[
    {
        "title": "Afghan cookies",
        "steps": [
            "Preheat the oven to 180C. Line a baking sheet with baking paper. Set aside.",
            "Cream the butter and sugar until light and fluffy.",
            "Sift together the flour and cocoa powder and mix into butter mixture with a wooden spoon. Fold in cornflakes and don't worry if they crumble.",
            "Roll or press 1 1/2 teaspoonfuls of the dough into balls and flatten them slightly. Place them about 2 inches apart on the baking sheet.",
            "Bake in the oven for 10-15 minutes. Remove from oven and cool on a wire rack.",
            "Prepare the icing by combining the icing sugar, unsweetened cocoa powder and water in a bowl. Mix well until the mixture is free of lumps and of a creamy consistency.",
            "Spoon a little icing on each cookie and then decorate with flaked almonds."
        ],
        "ingredients": [
            "200g butter, at room temperature",
            "1/2 cup caster sugar",
            "1 1/2 cups plain flour",
            "3 tbsp nestlÉ bakers' choice cocoa",
            "1 1/2 cups kellogg's cornflakes",
            "1 cup icing sugar",
            "2 tbsp nestlÉ bakers' choice cocoa",
            "3 tbsp water",
            "1/4 cup flaked almonds, or walnuts (optional)"
        ],
        "coordinates": [
            60.81768593419623,
            38.199537015474746
        ],
        "thumbnailUrl": "https://www.taste.com.au/assets/static/images/generic-placeholder.jpg"
    },
    {
        "title": "Prosciutto, artichoke and pesto filo pie",
        "steps": [
            "Preheat oven to 210°C. Spray a 25cm (base measurement) non-stick ovenproof frying pan with olive oil spray. Place 1 filo sheet in the pan and spray with olive oil spray. Top with another filo sheet at a 45-degree angle and spray with olive oil spray. Continue layering with remaining filo and olive oil spray, turning each filo sheet at a 45-degree angle.",
            "Spread half the pesto dip over the filo base. Arrange the artichoke, mushroom, tomato and prosciutto over the pesto. Gently scrunch down the edges of the filo. Bake for 10 mins. Top with bocconcini. Bake for 5-10 mins or until the filo is crisp and golden and the bocconcini melts slightly.",
            "Sprinkle with the rocket. Top with the remaining pesto dip."
        ],
        "ingredients": [
            "8 sheets filo pastry",
            "150g basil pesto dip",
            "100g drained marinated artichokes, quartered",
            "100g mushrooms, thinly sliced",
            "1/2 cup (75g) semi-dried tomatoes, drained",
            "100g prosciutto slices",
            "200g tub coles traditional bocconcini, drained, torn",
            "30g baby rocket leaves"
        ],
        "coordinates": [
            21.796308368649484,
            -17.141521465637567
        ],
        "thumbnailUrl": "https://img.taste.com.au/0zTcrQGG/w720-h480-cfill-q80/taste/2018/10/prosciutto-artichoke-and-pesto-filo-pie-142932-1.jpg"
    },
    {
        "title": "Argentinian beef empanadas",
        "steps": [
            "Preheat fan forced oven to 180 degrees.",
            "Place large frypan over high heat, add oil, when hot add onion, cook for a few minutes or until lightly golden, add garlic, cumin, paprika, cayenne pepper and cinnamon and cook for 2 minutes. Add beef, break up with a spatula and cook until a golden colour is achieved on the meat. Add tomato paste and currants and simmer for 5 – 10 minutes. Finish off filling by stirring through adding parsley, olives, eggs and season with salt and black pepper.",
            "Take one sheet of puff pastry and cut out a 15cm circle, place pastry round on a clean work surface, place a heaped tablespoon of filling in the centre of the pastry and join the two sides together to make a half moon shape, pinch the pastry together on the edges. Set aside on a baking tray lined with baking paper. Repeat with reing pastry and filling.",
            "Before baking, brush empanadas with a little egg, place in the oven and bake for 25 – 30 minutes or until golden and pastry is cooked through. Serve warm."
        ],
        "ingredients": [
            "1 small onion, finely diced",
            "2 tsp finely diced garlic",
            "2 x 500g packet coles butcher 3 star beef mince",
            "1 tsp ground cumin",
            "2 tsp smoked paprika",
            "1/4 tsp cayenne pepper",
            "pinch of cinnamon",
            "2 tbsp tomato paste",
            "1/4 cup currants",
            "1/2 cup roughly diced parsley",
            "1/2 cup (80g) roughly diced pitted olives (any)",
            "3 eggs, hard-boiled and roughly diced",
            "10 sheets of puff pastry, defrosted",
            "1 egg, lightly beaten",
            "1 tbsp olive oil"
        ],
        "coordinates": [
            -58.618427512659586,
            -41.467369831232745
        ],
        "thumbnailUrl": "https://img.taste.com.au/ndYIDaK7/w720-h480-cfill-q80/taste/2016/11/argentinian-beef-empanadas-90268-1.jpeg"
    },
    {
        "title": "Armenian nutmeg cake",
        "steps": [
            "Preheat oven to 180C/160C fan forced. Release the base from a 20cm (base measurement) springform pan and turn over. Secure base back in pan. Spray pan with oil spray. Line base with baking paper.",
            "Combine flours, sugar and ground almonds in a medium bowl. Use your fingertips to rub the butter into the flour mixture until fine breadcrumbs form. Press one-third of the mixture firmly over the base of the prepared pan (see notes). Set aside.",
            "Add the walnuts and nutmeg to the remaining flour mixture. Make a well in the centre. Combine the milk, sour cream, egg and bicarbonate soda in a medium bowl. Add to the flour mixture and stir well to combine. Pour over the base in the prepared pan.",
            "Bake for 50 to 55 minutes or until a skewer inserted into the centre of the cake comes out clean. Transfer pan to a wire rack to cool slightly then remove the side from the pan and set aside to cool completely.",
            "Dust the cake lightly with icing sugar before cutting into slices to serve."
        ],
        "ingredients": [
            "150g (1 cup) self-raising flour",
            "75g (1/2 cup) plain flour",
            "275g (1 1/4 cups) brown sugar",
            "60g (1/2 cup) ground almonds",
            "125g cold butter, chopped",
            "55g (1/2 cup) walnut halves, chopped",
            "2 tsp freshly grated nutmeg (see note)",
            "125ml (1/2 cup) milk",
            "125g (1/2 cup) sour cream",
            "1 egg, lightly whisked",
            "1 tsp bicarbonate soda",
            "icing sugar, to dust"
        ],
        "coordinates": [
            43.61760514281557,
            39.18273838459088
        ],
        "thumbnailUrl": "https://img.taste.com.au/5rR7r4-_/w720-h480-cfill-q80/taste/2021/08/armenian-nutmeg-cake-173268-2.jpg"
    },
    {
        "title": "Crab chowder",
        "steps": [
            "Heat butter in a large saucepan over medium heat. Cook bacon, onion and potato, stirring, for 5 mins or until golden. Add the flour and cook, stirring to coat well, for 1 min. Season.",
            "Slowly add the stock and bring to the boil. Reduce heat and simmer for 3-4 mins or until potato is tender. Stir in the crab meat, kale and vegetable mix. Cook for 2 mins or until hot. Ladle among bowls."
        ],
        "ingredients": [
            "30g butter",
            "100g coles brand streaky bacon, sliced",
            "1 brown onion, finely chopped",
            "250g desiree potatoes, peeled, cut into 1cm cubes",
            "1/4 cup plain flour",
            "1l chicken stock, heated",
            "460g antarctic king crab, meat picked, cut into chunks, from the deli (see notes)",
            "120g bag coles australian baby kale, coarsely chopped",
            "2 cups frozen peas, corn and capsicum"
        ],
        "coordinates": [
            -132.26622992111845,
            -82.8799907473199
        ],
        "thumbnailUrl": "https://img.taste.com.au/ukWkzKmy/w720-h480-cfill-q80/taste/2016/11/crab-chowder-98209-1.jpeg"
    },
    {
        "title": "Australia's favourite classic zucchini slice recipe",
        "steps": [
            "Preheat oven to 170°C fan forced.",
            "Beat the eggs in a large bowl until combined. Add the flour and beat until smooth, then add zucchini, onion, bacon, cheese and oil and stir to combine.",
            "Grease and line a 30 x 20cm lamington pan. Pour into the prepared pan and bake in oven for 30 minutes or until cooked through."
        ],
        "ingredients": [
            "5 coles australian free range eggs",
            "150g (1 cup) coles white self raising flour, sifted",
            "375g zucchini, grated, excess moisture squeezed out",
            "1 large onion, finely chopped",
            "200g rindless bacon, chopped",
            "1 cup grated cheddar cheese",
            "60ml (1/4 cup) vegetable oil"
        ],
        "coordinates": [
            151.226713952858,
            -17.45484398135454
        ],
        "thumbnailUrl": "https://img.taste.com.au/B4Pz2Dzj/w720-h480-cfill-q80/taste/2023/01/best-zucchini-slice-recipe-close-up-196308-1.jpg"
    },
    {
        "title": "Australia's favourite classic zucchini slice recipe",
        "steps": [
            "Preheat oven to 170°C fan forced.",
            "Beat the eggs in a large bowl until combined. Add the flour and beat until smooth, then add zucchini, onion, bacon, cheese and oil and stir to combine.",
            "Grease and line a 30 x 20cm lamington pan. Pour into the prepared pan and bake in oven for 30 minutes or until cooked through."
        ],
        "ingredients": [
            "5 coles australian free range eggs",
            "150g (1 cup) coles white self raising flour, sifted",
            "375g zucchini, grated, excess moisture squeezed out",
            "1 large onion, finely chopped",
            "200g rindless bacon, chopped",
            "1 cup grated cheddar cheese",
            "60ml (1/4 cup) vegetable oil"
        ],
        "coordinates": [
            10.369112419409905,
            47.551328849120566
        ],
        "thumbnailUrl": "https://img.taste.com.au/B4Pz2Dzj/w720-h480-cfill-q80/taste/2023/01/best-zucchini-slice-recipe-close-up-196308-1.jpg"
    },
    {
        "title": "One-pot beef sausage bourguignon with mash",
        "steps": [
            "Heat oil in a large, deep-sided frying pan over medium-high heat. Add sausages, and cook, turning occasionally, for 8-10 minutes or until browned. Transfer to a plate.",
            "Add mushroom, carrot, bacon and onion to the pan. Cook over medium-high heat, stirring occasionally, for 5-8 minutes or until the mushrooms and onion are starting to become golden. Add garlic and cook, stirring, for 30 seconds or until aromatic. Add flour and tomato paste. Cook, stirring, for 1 minute until well combined.",
            "Add wine and cook, stirring constantly, until well combined. Add stock and bay leaves and stir to combine. Bring to the boil. Return sausages to the pan. Reduce the heat to medium-low and simmer, uncovered, for 15 minutes or until the sausages are cooked through and the sauce thickens slightly. Season. Sprinkle with parsley. Serve with mashed potato and green beans."
        ],
        "ingredients": [
            "1 tbsp olive oil",
            "8 coles finest australian beef garlic & parsley sausages",
            "300g button mushrooms, halved",
            "8 baby carrots, peeled, cut into thick diagonal slices",
            "2 middle bacon rashers, cut into 2.5cm pieces",
            "1 large brown onion, cut into thick wedges",
            "2 garlic cloves, crushed",
            "2 tbsp plain flour",
            "2 tbsp tomato paste",
            "125ml (1/2 cup) red wine",
            "500ml (2 cups) beef stock",
            "2 dried bay leaves",
            "finely chopped fresh continental parsley leaves, to serve",
            "600g pkt coles kitchen mashed potato, warmed",
            "green beans, steamed, halved, to serve"
        ],
        "coordinates": [
            29.0818355458672,
            -3.8757437285448892
        ],
        "thumbnailUrl": "https://img.taste.com.au/_NOfppOt/w720-h480-cfill-q80/taste/2025/05/one-pot-beef-sausage-bourguignon-with-mash-hero-212312-1.jpg"
    },
    {
        "title": "Chocolate chip cookies with choc-marshmallow dip",
        "steps": [
            "Preheat oven to 220C or 200C fan-forced.",
            "Finely chop Coles Brand Belgian Milk Chocolate. Place in a 1 1/4-cup ovenproof dish. Top with 13 white marshmallows, flat-side up. Bake for 4-5 minutes or until the chocolate melts and marshmallows become golden. Stand for 5 minutes.",
            "Serve with Coles Brand Chocolate Chip Cookies for dipping."
        ],
        "ingredients": [
            "75g coles brand belgian milk chocolate",
            "13 white marshmallows",
            "400g pkt coles brand chocolate chip cookies"
        ],
        "coordinates": [
            3.2672619125205387,
            51.03176334006344
        ],
        "thumbnailUrl": "https://img.taste.com.au/a7FmeNjM/w720-h480-cfill-q80/taste/2016/11/chocolate-chip-cookies-with-choc-marshmallow-dip-108617-1.jpeg"
    },
    {
        "title": "Sweet & sour prawns with green beans",
        "steps": [
            "To make sauce, heat 1 tablespoon olive oil in a medium saucepan over medium heat and cook onion for 3 mins. Add chilli and ginger and cook for a further 2 mins, then add pineapple and cook for a further minute.",
            "Add vinegar, tomato sauce, soy sauce, sugar and pineapple juice and bring to a simmer. Simmer for 6-7 mins, or until sauce begins to thicken. Remove from the heat.",
            "Place a large frying pan over high heat and add remaining oil. Once oil begins to smoke, add prawns and cook for 2 mins, stirring occasionally. Add beans and cook for a further 2 mins, then season lightly with salt and pepper.",
            "Add sweet and sour sauce and toss well to coat prawns and green beans. Garnish with chopped coriander and serve with steamed rice."
        ],
        "ingredients": [
            "2 tbsp coles brand pure olive oil",
            "1/2 brown onion, finely chopped",
            "1/2 red chilli, thinly sliced",
            "2 tbsp ginger, finely chopped",
            "1 cup fresh pineapple, finely chopped",
            "1/4 cup rice wine vinegar",
            "1/4 cup tomato sauce",
            "2 tbsp coles brand soy sauce",
            "1/4 cup brown sugar",
            "3/4 cup fresh pineapple juice",
            "500g raw banana prawns, peeled, deveined, tail left on",
            "2 cups green beans",
            "1 tbsp coriander, chopped",
            "steamed white rice, to serve"
        ],
        "coordinates": [
            1.1425362421072425,
            8.19521600454504
        ],
        "thumbnailUrl": "https://img.taste.com.au/ZN1ePWrl/w720-h480-cfill-q80/taste/2016/11/sweet-sour-prawns-with-green-beans-89806-1.jpeg"
    },
    {
        "title": "Roast ocean trout with prosciutto and parsley sauce",
        "steps": [
            "Preheat oven to 180C. Trim belly flaps of fish then place fish in a large oiled roasting pan. Season fish cavity with salt and pepper then fill with lemon and thyme. Pour wine over fish. Wrap tail in a piece of oiled foil to prevent burning. Roast fish for 35 minutes or until tender, then peel back skin, starting at the head, and discard. Remove fins and discard. Using a small spoon, scrape along fish spine - this will make it easier to remove the flesh.",
            "For sauce, heat 2 tablespoons oil in a frying pan over medium heat. Add prosciutto. Cook, stirring, for 2-3 minutes or until crisp. Drain on paper towels. Place parsley in a heatproof bowl. Pour over boiling water then drain. Refresh in cold water then drain (this brightens parsley's colour). Finely chop parsley then combine with garlic, remaining oil, lemon juice and cornichons. Season to taste. Before serving, add prosciutto.",
            "To serve, place room-temperature fish on a platter and spoon over a little sauce. Serve with remaining sauce."
        ],
        "ingredients": [
            "3kg ocean trout, cleaned, head removed",
            "2 lemons, thinly sliced",
            "1 bunch thyme",
            "1 cup (250ml) dry white wine",
            "150ml colavita extra virgin olive oil",
            "8 (120g) slices prosciutto, finely shredded",
            "1 cup firmly packed flat-leaf parsley leaves",
            "2 cloves garlic, finely chopped",
            "juice of 1/2 lemon",
            "1/4 cup (45g) finely chopped cornichons"
        ],
        "coordinates": [
            -1.5776584672540843,
            10.40421933215062
        ],
        "thumbnailUrl": "https://img.taste.com.au/0nF00_ea/w720-h480-cfill-q80/taste/2016/11/roast-ocean-trout-with-prosciutto-and-parsley-sauce-16433-1.jpeg"
    },
    {
        "title": "Peppery cheese spread",
        "steps": [
            "Use a fork to mash the feta in a bowl. Add the ricotta, cream, green shallot, mint and Tabasco sauce. Stir until well combined. Spoon into a serving dish.",
            "Preheat oven to 180°C. Brush the bread wedges with oil. Place on baking trays and bake in preheated oven for 3 minutes or until crisp. Serve immediately with the cheese spread."
        ],
        "ingredients": [
            "150g bulgarian feta",
            "100g fresh ricotta",
            "60ml (1/4 cup) thin cream",
            "1 green shallot, trimmed, finely chopped",
            "2 tsp chopped fresh mint",
            "1/4 tsp red tabasco pepper sauce, or to taste",
            "1 400g pkt white kebab bread, each piece cut into 6 wedges",
            "1 tbsp extra virgin olive oil"
        ],
        "coordinates": [
            26.033061888499365,
            43.72201365433284
        ],
        "thumbnailUrl": "https://img.taste.com.au/rHWhHaZK/w720-h480-cfill-q80/taste/2016/11/peppery-cheese-spread-20926-1.jpeg"
    },
    {
        "title": "Banana bread",
        "steps": [
            "Preheat oven to 180°C. Grease and line the base and side of an 11 x 21cm x 6cm deep (base) loaf pan.",
            "Combine plain flour, self-raising flour, sugar and cinnamon in a large bowl. Whisk butter and eggs together. Stir in banana. Spoon into prepared pan. Smooth the surface.",
            "Bake for 45-50 mins or until a skewer inserted into the centre comes out clean. Set aside in the pan for 10 mins before turning out onto a wire rack. Serve warm spread with butter."
        ],
        "ingredients": [
            "1 cup (150g) plain flour",
            "1/2 cup (75g) self-raising flour",
            "1 cup brown sugar",
            "1 tsp coles cinnamon ground",
            "125g butter, melted, cooled",
            "2 eggs, whisked",
            "3 ripe bananas, mashed"
        ],
        "coordinates": [
            -78.28918230264392,
            26.81054651740849
        ],
        "thumbnailUrl": "https://img.taste.com.au/QtqlNOxg/w720-h480-cfill-q80/taste/2016/11/banana-bread-23369-1.jpeg"
    },
    {
        "title": "Mussels in chilli tomato sauce",
        "steps": [
            "Heat oil in a large, deep saucepan over medium heat. Add onion, garlic and chilli. Cook, stirring, for 3 minutes or until onion is soft. Add tomato paste and cook for 1 minute.",
            "Add tomato, lemon rind, lemon juice, sugar and wine to pan. Stir until well combined. Increase heat to high. Bring sauce to the boil. Reduce heat to medium. Simmer, uncovered, for 8 to 10 minutes or until thick. Season with salt and pepper.",
            "Add mussels to sauce. Cover and cook, shaking pan occasionally, for 3 to 5 minutes or until mussel shells open. Discard unopened shells. Ladle sauce and mussels into bowls. Sprinkle with parsley. Serve with bread."
        ],
        "ingredients": [
            "2 tbsp coles classic olive oil",
            "1 brown onion, finely chopped",
            "2 garlic cloves, crushed",
            "2 small red chillies, deseeded, finely chopped",
            "1 tbsp coles tomato paste",
            "1kg tomatoes, finely chopped",
            "1 lemon, rind finely grated, juiced",
            "2 tsp caster sugar",
            "1/2 cup dry white wine",
            "1.5kg mussels, beards removed (see note)",
            "1/2 cup flat-leaf parsley leaves, roughly chopped",
            "crusty bread, to serve"
        ],
        "coordinates": [
            31.4153831447055,
            55.52684839040016
        ],
        "thumbnailUrl": "https://img.taste.com.au/Q5Bou8Gt/w720-h480-cfill-q80/taste/2016/11/mussels-in-chilli-tomato-sauce-1712-1.jpeg"
    },
    {
        "title": "Chicken-free schnitzel with slaw",
        "steps": [
            "Cook schnitzels following packet directions.",
            "Prepare salad kit without dressing. Divide salad, schnitzels and avocado among serving plates. Serve with dressing."
        ],
        "ingredients": [
            "2 x 300g herb & sons chicken-free schnitzels",
            "520g coles family coleslaw kit",
            "1 avocado, peeled, stoned, sliced"
        ],
        "coordinates": [
            -88.5121831392882,
            16.604140808410964
        ],
        "thumbnailUrl": "https://img.taste.com.au/0KGTDylO/w720-h480-cfill-q80/taste/2019/09/chicken-free-schnitzel-with-slaw-154010-2.jpg"
    },
    {
        "title": "Brazilian-style chicken",
        "steps": [
            "Score the skin on the drumsticks with a sharp knife. Sprinkle the chicken all over with salt and black pepper. Place a large heavy frying pan on medium-high heat. Drizzle oil into the hot pan and add the chicken, skin side down. Cook for 5-10 minutes or until golden brown all over. Transfer to a plate and drain all but 1 tablespoon of the oil from the pan.",
            "Add the onions and saute for 2 minutes. Add capsicums, tomatoes and garlic and saute for 4 minutes or until the capsicum has softened slightly. Season the vegetables with salt and pepper to taste. Return chicken to the pan. Cover and simmer for 10 minutes until the chicken is cooked through. Serve with steamed rice and broccoli."
        ],
        "ingredients": [
            "2 tbsp coles olive oil",
            "1 clove garlic, finely chopped",
            "8 chicken drumsticks",
            "1 onion, thinly sliced",
            "2 red capsicums, thinly sliced",
            "2 roma tomatoes, thinly sliced",
            "salt, to season",
            "freshly ground black pepper, to season",
            "steamed long grain rice, to serve",
            "steamed broccoli, to serve"
        ],
        "coordinates": [
            -62.15339314838492,
            -20.221029833934615
        ],
        "thumbnailUrl": "https://img.taste.com.au/GmN6Loe_/w720-h480-cfill-q80/taste/2016/11/brazilian-style-chicken-94170-1.jpeg"
    },
    {
        "title": "Egg and leek breakfast tarts",
        "steps": [
            "Preheat oven to 180C or 160C fan-forced. Lightly grease 6 x 10cm (base measurement) pie dishes or loose-bottom flan tins. Use a saucer as a guide to cut 6 x 15cm rounds from the pastry, and ease them into the tins. Line each with a piece of crumpled non-stick baking paper, and fill with dried rice or beans. Bake for 10 mins, remove paper and rice and bake a further 5 mins, or until cooked and lightly golden. Cool completely.",
            "Heat oil in a small frying pan. Cook leeks over medium-low heat for 7 mins, or until soft. Cool, then divide between pastry cases. Sprinkle with parmesan.",
            "Lightly beat eggs and cream together, and pour into pastry cases. Bake for 25-30 mins, or until set and golden. Place tomatoes on a baking tray and add to the oven with the tarts. Bake for about 20 mins, or until softened.",
            "Meanwhile, cook sausages in a lightly oiled frying pan over medium-low heat for 10 mins, or until well-browned and cooked through. Serve tarts with tomatoes, sausages and rocket."
        ],
        "ingredients": [
            "3 sheets coles frozen shortcrust pastry, thawed",
            "2 tbsp coles pure olive oil",
            "2 large leeks, white part only, sliced",
            "1/3 cup coles shredded parmesan cheese",
            "6 coles free range eggs",
            "2/3 cup coles cream",
            "2 x 250g packets cherry truss tomatoes",
            "16 coles butcher thin beef sausages",
            "1 bunch rocket, washed and trimmed"
        ],
        "coordinates": [
            115.08684613237514,
            5.214190082658453
        ],
        "thumbnailUrl": "https://img.taste.com.au/gfdFenH3/w720-h480-cfill-q80/taste/2016/11/egg-and-leek-breakfast-tarts-107620-1.jpeg"
    },
    {
        "title": "Bhuna-style chicken drumstick curry",
        "steps": [
            "To make the marinade, combine all the marinade ingredients in a large bowl.",
            "Add the chicken to the bowl. Turn to coat. Cover with plastic wrap and place in the fridge for 1 hour to marinate.",
            "Heat the ghee in a large frying pan over medium-high heat. (Alternatively, use the Browning function on a slow cooker.) Add half the chicken. Cook for 8 minutes or until golden brown. Transfer to the slow cooker. Repeat with the remaining chicken.",
            "Add the onion to the pan. Reduce heat to medium. Cook, stirring, for 10-15 minutes or until dark brown. Add cinnamon, cardamom, cumin, ground coriander, garam masala and turmeric. Stir for 1 minute or until aromatic. Stir in passata, stock and fresh chilli. Season with salt. Bring to the boil. Transfer to the slow cooker. Cover and cook on High for 3 hours or until chicken is tender and cooked through.",
            "Sprinkle the curry with fresh coriander and extra fresh chilli. Serve with rice and yoghurt, if using."
        ],
        "ingredients": [
            "8 (about 1.8kg) chicken drumsticks",
            "2 tbs ghee",
            "2 large brown onions, thinly sliced",
            "2 cinnamon sticks",
            "3 cardamom pods, crushed",
            "1 tsp cumin seeds",
            "1 tsp ground coriander",
            "1 tsp garam masala",
            "1⁄2 tsp ground turmeric",
            "500ml (2 cups) passata",
            "250ml (1 cup) massel stock chicken style",
            "2 small fresh red chillies, halved, plus extra, thinly sliced, to serve",
            "fresh coriander sprigs to serve",
            "steamed basmati rice to serve",
            "natural yoghurt, to serve (optional)",
            "4 garlic cloves, crushed",
            "3cm-piece fresh ginger, peeled, finely grated",
            "1 tsp ground cumin",
            "1 tsp table salt",
            "1⁄2 tsp ground coriander",
            "1⁄2 tsp ground chilli",
            "1⁄2 tsp ground turmeric",
            "2 tbsp vegetable oil"
        ],
        "coordinates": [
            92.06473680381882,
            28.220450446159944
        ],
        "thumbnailUrl": "https://img.taste.com.au/GEXhTwDq/w720-h480-cfill-q80/taste/2022/05/bhuna-style-chicken-drumstick-curry-178599-2.jpg"
    },
    {
        "title": "Maple brie smashed roast potatoes recipe",
        "steps": [
            "Preheat oven to 220°C/200°C fan forced. Grease 24 holes of a 30ml (1 1/2 tbsp) mini muffin pan with olive oil.",
            "Place potatoes in a saucepan and cover with cold water. Cover and bring to the boil over medium-high heat. Uncover the pan and cook for 15 minutes or slightly longer, depending on their size. The potatoes should be tender when pierced with a small sharp knife or skewer. Drain and set aside on a tray to cool.",
            "Halve potatoes and place cut-side up in the prepared muffin pan holes (see notes). Use your thumb or the back of a small spoon to press down in the centre of each potato to make an indentation and form a tart shell shape.",
            "Combine butter and syrup in a small bowl. Brush potato shells with maple mixture. Season with salt. Roast for 25-30 minutes or until golden brown. Set aside to cool slightly. Carefully lift potato shells out of the muffin pan and transfer to a baking tray.",
            "Place a brie wedge in each potato shell. Top each with 1/2 tsp chutney. Roast for 5 minutes or until the brie has softened and the potato is warm. Drizzle with extra maple syrup, and serve. Watch our step-by-step video below to see how to make our maple brie smashed roast potatoes recipe."
        ],
        "ingredients": [
            "12 baby white potatoes",
            "20g unsalted butter, melted",
            "1 tbsp coles finest pure canadian maple syrup",
            "200g wheel coles finest australian triple cream brie, cut into 24 wedges",
            "90g (1/4 cup) coles caramelised onion & balsamic chutney",
            "2 tbsp coles finest pure canadian maple syrup, extra"
        ],
        "coordinates": [
            -88.462402695566,
            70.86802393734712
        ],
        "thumbnailUrl": "https://img.taste.com.au/T4F0Mg8g/w720-h480-cfill-q80/taste/2025/03/maple-brie-smashed-roast-potatoes-3-209778-1.jpg"
    },
    {
        "title": "Christmas trifle",
        "steps": [
            "Make jelly according to packet directions. Pour into 1 large rectangular tray or two smaller trays. Refrigerate 3-4 hrs, until set.",
            "Cut jelly into pieces. Place half the swiss roll cubes in base of large glass serving bowl. Sprinkle over half the orange juice, sherry or liqueur. Top with half the custard and half the jelly. Scatter over all the berries.",
            "Repeat layering with remaining swiss roll, orange juice, custard and jelly. Spread over whipped cream. Cover with plastic wrap and chill 3-4 hours.",
            "Drizzle over passionfruit and scatter with almonds to serve."
        ],
        "ingredients": [
            "2 x 85g packets aeroplane port wine or raspberry jelly",
            "400g packet jam swiss roll, cut into 3cm cubes",
            "1/3 cup orange juice, sherry or orange-flavoured liqueur",
            "1 litre vanilla custard",
            "425g can coles mixed berries, well drained",
            "300ml tub whipping cream, whipped",
            "170g can coles brand passionfruit pulp",
            "1/2 x 110g packet lucky flaked almonds, toasted"
        ],
        "coordinates": [
            6.024238314838708,
            47.7274603559141
        ],
        "thumbnailUrl": "https://img.taste.com.au/E7VRNxNy/w720-h480-cfill-q80/taste/2016/11/christmas-trifle-108018-1.jpeg"
    },
    {
        "title": "Completo (Chilean hot dogs)",
        "steps": [
            "Heat oil in a medium saucepan over medium heat. Cook sausages, turning, for 5 mins or until cooked through.",
            "Meanwhile, combine avocado and lemon juice in a medium bowl. Season.",
            "Place sausages in rolls. Top with mayonnaise, avocado mixture, tomato, onion and coriander leaves. Serve with sweet potato wedges."
        ],
        "ingredients": [
            "1 tsp vegetable oil",
            "4 thin coles bbq sausages",
            "1 avocado, mashed",
            "2 tsp lemon juice",
            "4 coles brand hot dog rolls",
            "1/3 cup (100g) whole-egg mayonnaise",
            "1 tomato, finely chopped",
            "1/2 small red onion, finely chopped",
            "2 tbsp coriander leaves",
            "sweet potato wedges, to serve"
        ],
        "coordinates": [
            -68.81915097529652,
            -21.0822907946272
        ],
        "thumbnailUrl": "https://img.taste.com.au/4WJUKNDj/w720-h480-cfill-q80/taste/2016/11/completo-chilean-hot-dogs-109181-1.jpeg"
    },
    {
        "title": "Chinese beef dumpling soup",
        "steps": [
            "To make the dumplings, combine the mince, ginger, garlic, coriander, mint and 2 tablespoons soy sauce in a large bowl. Place 1 wrapper on a clean board. Drop 1 heaped teaspoons of mince mixture in the centre of the wrapper. Brush edges with water and pinch together to seal. Repeat with remaining wrappers and mince mixture. Freeze half the dumplings for another meal (see Notes).",
            "Combine the consomme, lime leaves and water in a large saucepan. Bring to the boil. Simmer for 15 mins to infuse. Discard lime leaves.",
            "Bring broth to the boil. Add remaining dumplings and simmer for 5 mins or until dumplings are cooked through. Stir in remaining soy sauce.",
            "Divide choy sum and onion among bowls. Ladle over broth and dumplings. Top with bean sprouts, chilli and extra coriander and mint."
        ],
        "ingredients": [
            "2 cups beef consomme",
            "3 fresh lime leaves (optional - see tips)",
            "1.5l water",
            "1 bunch choy sum, trimmed, chopped",
            "2 spring onions, thinly sliced diagonally",
            "1 cup bean sprouts",
            "1 long red chilli, finely chopped",
            "mint leaves, extra, to serve",
            "coriander sprigs, extra, to serve dumplings",
            "500g coles 5-star beef mince",
            "2 tbsp grated fresh ginger",
            "2 garlic cloves, crushed",
            "2 tbsp chopped coriander",
            "2 tbsp chopped mint",
            "1/4 cup soy sauce",
            "48 wonton wrappers (see tips)"
        ],
        "coordinates": [
            82.7033321187904,
            45.49020016347565
        ],
        "thumbnailUrl": "https://img.taste.com.au/WJADLaBx/w720-h480-cfill-q80/taste/2016/11/chinese-beef-dumpling-soup-90288-1.jpeg"
    },
    {
        "title": "Coffee meringue torte",
        "steps": [
            "Preheat oven to 180°C. Place the chocolate melts in a small heatproof bowl. Pour over the coffee. Microwave on high, stirring every 30 secs, until the chocolate melts and mixture is smooth and well combined.",
            "Line 3 baking trays with baking paper. Draw a 20cm circle on each tray and turn paper over. Use an electric mixer to whisk egg whites in a clean, dry bowl until soft peaks form. Gradually add the sugar, 1 tbs at a time, whisking well after each addition, until sugar completely dissolves and mixture is thick and glossy. Add the cornflour and vinegar and whisk until combined.",
            "Divide the meringue mixture into 3 even portions. Spoon onto circles on the lined trays. Spoon 1 tbs of the chocolate mixture over each portion on the lined trays. Using each circle as a guide, gently marble and spread to a 20cm disc. Reduce oven to 120°C. Bake the meringues, swapping trays halfway through cooking, for 1 hour or until dry to touch. Turn oven off. Leave in oven, with door ajar, for 1 hour to cool completely.",
            "Use an electric mixer to whisk mascarpone, cream and extra coffee in a bowl until soft peaks form.",
            "Place 1 meringue disc on a serving plate. Spoon over one-third of the cream mixture. Continue layering with remaining meringue discs and cream mixture, finishing with cream mixture. Top with raspberries and drizzle with the remaining chocolate mixture. Sprinkle with chocolate curls. Serve immediately."
        ],
        "ingredients": [
            "100g dark chocolate melts",
            "1/3 cup (80ml) brewed coles urban coffee culture colombia ground single origin",
            "8 coles australian free range egg whites",
            "2 cups (440g) caster sugar",
            "2 tsp cornflour",
            "1 tsp white vinegar",
            "500g mascarpone",
            "600ml coles thickened cream",
            "1/4 cup (60ml) brewed coles urban coffee culture colombia ground single origin",
            "extra raspberries, to serve",
            "dark chocolate curls, to serve"
        ],
        "coordinates": [
            -67.71577368277364,
            -2.821438432752008
        ],
        "thumbnailUrl": "https://img.taste.com.au/IS-8inkW/w720-h480-cfill-q80/taste/2020/01/meringuestack_high04-157538-1.jpg"
    },
    {
        "title": "Choc-vanilla puffed rice sticks",
        "steps": [
            "Grease two 20cm x 30cm slice pans and line with baking paper, allowing long sides to overhang.",
            "Stir half the marshmallows and half the butter in a medium saucepan over medium heat until melted and combined.",
            "Place the rice puffs in a large bowl. Add marshmallow mixture and stir until smooth. Use wet hands to press mixture firmly into 1 prepared pan. Chill for 2 hrs or until firm.",
            "Stir the remaining marshmallows, butter and chocolate in a medium saucepan over medium heat until melted and combined.",
            "Place the cocoa puffs in a large bowl. Add the marshmallow mixture and stir until smooth. Use wet hands to press the mixture firmly into the remaining prepared pan.",
            "Use 5-6cm cutters to cut shapes from each mixture. Carefully thread onto trimmed skewers."
        ],
        "ingredients": [
            "500g marshmallows (see notes)",
            "150g butter, chopped",
            "4 cups coles brand rice puffs",
            "1/2 cup dark chocolate bits",
            "4 cups coles brand cocoa puffs"
        ],
        "coordinates": [
            -82.95038763073015,
            9.840350222590212
        ],
        "thumbnailUrl": "https://img.taste.com.au/YP5m_4hM/w720-h480-cfill-q80/taste/2016/11/choc-vanilla-puffed-rice-sticks-98097-1.jpeg"
    },
    {
        "title": "Cuban mojo pork",
        "steps": [
            "Combine lime juice, garlic, chopped coriander, chopped mint, oregano, cumin, 1 1/2 cups (375ml) orange juice and 1 tbs oil in a glass dish. Add pork. Turn to coat. Cover and place in fridge for 4 hours to develop the flavours.",
            "Heat a large frying pan or barbecue grill on medium-low. Drain pork, reserving marinade. Cook the pork, partially covered, turning, for 15-18 mins or until browned and cooked through. Transfer to a plate. Cover and set aside for 5 mins to rest.",
            "While the pork is resting, place reserved marinade in a frying pan over medium-high heat. Cook for 5 mins or until mixture reduces by half. Transfer to a heatproof bowl. Wipe pan clean. Place over high heat. Add orange slices and cook for 1 min each side or until browned.",
            "Place salad mix and seed sachet from salad kit in a bowl (reserve dressing from the kit for another use). Combine vinegar and remaining orange juice and oil in a bowl and pour over salad. Arrange pork and orange slices on a platter. Drizzle with marinade. Serve with the corn, coriander sprigs, mint sprigs and salad."
        ],
        "ingredients": [
            "2 tbs lime juice",
            "2 garlic cloves, crushed",
            "2 tbs chopped coriander",
            "2 tbs chopped mint",
            "2 tbs chopped oregano",
            "1 tsp ground cumin",
            "1 3/4 cups (435ml) nudie orange juice with pulp",
            "1/4 cup (60ml) olive oil",
            "2 (400g each) pork tenderloins, trimmed",
            "2 oranges, thickly sliced",
            "350g pkt coles kitchen kaleslaw salad kit",
            "2 tbs apple cider vinegar",
            "barbecued corn, to serve",
            "coriander sprigs, to serve",
            "mint leaves, to serve"
        ],
        "coordinates": [
            -80.5480838297483,
            21.723906442558757
        ],
        "thumbnailUrl": "https://img.taste.com.au/Dc7FA7kc/w720-h480-cfill-q80/taste/2021/11/oct21-cuban-mojo-pork-taste-175169-1.png"
    },
    {
        "title": "Cypriot grain salad",
        "steps": [
            "Place burghul in a heatproof bowl. Cover with boiling water. Set aside for 20 minutes or until tender. Drain. Transfer to a large bowl.",
            "Add the lentils, onion, coriander, parsley, seed mix, almonds, currants, cranberries, capers, juice and oil to the bowl with the burghul. Gently to combine. Season.\n\nWatch our step-by-step video below to see how to make this Cypriot grain salad."
        ],
        "ingredients": [
            "170g (1 cup) burghul",
            "400g can no-added salt lentils, rinsed, drained",
            "1 small red onion, finely chopped",
            "1 cup chopped fresh coriander leaves",
            "1 cup chopped fresh continental parsley leaves",
            "80g (1/2 cup) seed mix, toasted (see notes)",
            "35g (1/3 cup) flaked almonds, toasted",
            "45g (1/4 cup) currants",
            "75g (1/2 cup) dried cranberries, coarsely chopped",
            "50g (1/4 cup) drained capers, coarsely chopped",
            "60ml (1/4 cup) fresh lemon juice",
            "60ml (1/4 cup) coles classic olive oil"
        ],
        "coordinates": [
            32.80082412014935,
            35.06994568679505
        ],
        "thumbnailUrl": "https://img.taste.com.au/7Fq49OF9/w720-h480-cfill-q80/taste/2021/12/cypriot-salad-175603-1.jpg"
    },
    {
        "title": "Beef schnitzel with mashed potatoes",
        "steps": [
            "For the Mashed Potatoes: Cover potatoes with cold salted water in a large heavy-based saucepan. Bring to the boil. Cook for 20-25 mins, or until tender. Drain in a colander and stand for 5 mins to steam dry.",
            "Press the potatoes through a large sieve or potato ricer back into the same pan. Stir in the milk and butter until very smooth. Season with salt and pepper.",
            "For the Schnitzels: Place bread into a food processor and blend to fine crumbs. Using 3 separate plates, scatter flour over first plate and season with salt and pepper. Beat eggs with mustard in a small bowl and pour onto second plate. Scatter breadcrumbs over the third plate.",
            "Dust schnitzel in flour, then dip into egg mixture, and finally into the breadcrumbs, pressing on to coat. Place crumbed schnitzel on a separate plate. Repeat with the remaining schnitzels.",
            "Heat 2 tablespoons oil in a large heavy-based frying pan over high heat. When pan is hot, add 2 schnitzels to the pan. Cook for 2 mins on each side until golden. Remove to serving plates. Repeat with another 2 tablespoons oil and remaining schnitzels.",
            "Remove oil from pan and wipe clean. Return pan to the heat. Once hot, add the remaining oil and allow to heat for 1 min. Add the green beans and cook for 2 mins, or until just tender. Season with salt and pepper. Serve with schnitzels and mashed potato."
        ],
        "ingredients": [
            "1kg red washed potatoes, peeled, cut into 3cm chunks",
            "1/2 cup coles brand full cream milk, warmed",
            "75g coles brand unsalted butter, at room temperature",
            "4 coles brand beef schnitzels",
            "5 tbsp olive oil",
            "230g green beans",
            "5 slices coles brand white sliced bread",
            "1/3 cup plain flour",
            "2 coles brand free range eggs",
            "1 tbsp coles brand dijon mustard"
        ],
        "coordinates": [
            12.661500439346787,
            54.77941447289295
        ],
        "thumbnailUrl": "https://img.taste.com.au/fEE1dhkD/w720-h480-cfill-q80/taste/2016/11/beef-schnitzel-with-mashed-potatoes-89878-1.jpeg"
    },
    {
        "title": "Cheat's apricot danish",
        "steps": [
            "Preheat oven to 180C or 160C fan. Line two baking trays with non-stick baking paper. Combine ricotta, icing sugar and vanilla until smooth. Cut each sheet of pastry into quarters. Spread about 2 tablespoons of ricotta mixture diagonally across each square.",
            "Halve apricots and arrange, cut side down, over ricotta. Fold two corners in over the apricots and press together gently. Arrange on baking trays and brush pastry with egg. Bake for 15-20 mins, or until golden brown. Place onto wire racks to cool.",
            "Dust with icing sugar and serve."
        ],
        "ingredients": [
            "300g fresh ricotta",
            "3 tbsp icing sugar",
            "1 tsp vanilla essence",
            "2 sheets frozen puff pastry, thawed",
            "2 cans apricot halves, drained",
            "1 coles free range egg, lightly beaten",
            "icing sugar, to dust"
        ],
        "coordinates": [
            11.616409466234192,
            54.94537566556181
        ],
        "thumbnailUrl": "https://img.taste.com.au/YZovpFOw/w720-h480-cfill-q80/taste/2016/11/cheats-apricot-danish-102192-1.jpeg"
    },
    {
        "title": "Algerian chorba",
        "steps": [
            "In a casserole dish or frying pan, brown the beef in the oil. Add the vegetables, mix well. Add tomato paste, spices, harissa and coriander leaves. Cover with water and leave to simmer for about 45 minutes.",
            "After simmering, sieve soup, reserving the liquid. Return cooked meat to the fry pan. Add reserved liquid. Before serving, add pasta and cook for approx. 7 mins. Present with some coriander leaves and orange."
        ],
        "ingredients": [
            "300-500g beef, cubed (such as boneless beef shoulder)",
            "3 tbsp olive oil",
            "1 small tub tomato paste",
            "1/2 cup pasta",
            "2 medium onion, chopped",
            "3 medium potatoes, chopped",
            "2 sticks celery, chopped",
            "water",
            "3 carrots, chopped",
            "2 zucchini, chopped",
            "1 turnip, chopped",
            "2 tomatoes, chopped",
            "chickpeas (optional)",
            "salt and pepper, harissa",
            "ground coriander",
            "ground caraway",
            "ground cinnamon",
            "coriander leaves, to serve"
        ],
        "coordinates": [
            -4.712098239361595,
            23.65539511331306
        ],
        "thumbnailUrl": "https://img.taste.com.au/wxZ2qT_6/w720-h480-cfill-q80/taste/2016/11/algerian-chorba-94182-1.jpeg"
    },
    {
        "title": "Plum jam",
        "steps": [
            "Place a couple of small saucers in the freezer to chill. Place peppercorns, anise, clove, cinnamon, bay leaves, wine and 1 cup sugar in a large, wide, heavy-based saucepan and stir over medium heat until sugar dissolves. Bring to the boil then simmer for 10 minutes. Turn off heat and leave to cool. When cool, strain though a fine sieve over a bowl.",
            "Return strained syrup to pan with 1 cup water and plums. Bring to the boil. Cover with a lid and simmer over low-medium heat for 35 minutes.",
            "Uncover pan. Add lemon juice and remaining sugar. Cook, stirring, until sugar dissolves. Bring to the boil then simmer, uncovered, over medium heat, skimming any scum from top, for 45-50 minutes or until jam jells when tested. To test, place a small spoonful on a chilled saucer then return to freezer for 1 minute. Run your finger through chilled jam; it should be the consistency of honey and wrinkle slightly when pushed. Once at this stage, pour into hot sterilised jars and seal. (see note)"
        ],
        "ingredients": [
            "1 tsp black peppercorns",
            "1 tsp anise seeds",
            "6 cloves",
            "1/2 cinnamon stick",
            "2 dried bay leaves, crumbled",
            "2 cups dry red wine",
            "1.25kg white sugar",
            "2 kg plums (try amber or blood plums), quartered, stoned",
            "1/3 cup (80ml) lemon juice"
        ],
        "coordinates": [
            -77.2409899766127,
            -1.0400430451623537
        ],
        "thumbnailUrl": "https://img.taste.com.au/ugBs4x7a/w720-h480-cfill-q80/taste/2016/11/plum-jam-17474-1.jpeg"
    },
    {
        "title": "Easy chicken shawarma (doner kebab)",
        "steps": [
            "Preheat oven to 210C/190C fan forced. Line a baking tray with sides with baking paper.",
            "Cut chicken into 10 pieces (about 8cm x 12cm). Place two 16cm skewers parallel to each other approximately 5cm apart. Skewer half the chicken onto the skewers, then press half a garlic bulb into the base of the skewers, cut-side down. Repeat with another 2 skewers, remaining chicken and remaining garlic.",
            "Place skewers, garlic side down on the prepared tray (if they won’t stand up straight on their own, you can lean them against each other). Drizzle over any marinade from the chicken packet and then drizzle with oil. Bake for 45 minutes or until chicken is golden and cooked through. Remove chicken from the oven and rest for 5 minutes.",
            "Meanwhile, combine yoghurt, parsley and half the lemon juice in a small bowl. Season.",
            "Combine lettuce, tomato and remaining lemon juice in another small bowl. Season.",
            "Reserve and set aside garlic from the skewers. Place chicken skewers on a board standing up. Using a large knife, thinly slice chicken from the skewers. When cool enough to handle, squeeze garlic cloves from the bulbs into a small bowl.",
            "Spread flatbreads with garlic dip. Top with chicken and tomato mixture. Drizzle with any juices from the tray. Top with pickles and dollop with yoghurt mixture. Scatter over roasted garlic. Wrap to enclose the filling and serve. Watch our step-by-step video below to see how to make our easy chicken shawarma recipe."
        ],
        "ingredients": [
            "1kg pkt coles herb & garlic boneless whole chicken",
            "1 garlic bulb, halved horizontally",
            "1 tbsp extra virgin olive oil",
            "180g (2/3 cup) greek-style yoghurt",
            "1/3 cup finely chopped fresh continental parsley",
            "2 tbsp fresh lemon juice",
            "1 baby cos lettuce, halved, finely chopped",
            "2 small tomatoes, finely chopped",
            "6 coles bakery flatbreads",
            "310g tub garlic dip",
            "60g (1/2 cup) sliced pickled red onion, drained",
            "3 dill pickles, cut into wedges lengthways"
        ],
        "coordinates": [
            29.85128842619279,
            31.3501531520873
        ],
        "thumbnailUrl": "https://img.taste.com.au/iABAN0Gd/w720-h480-cfill-q80/taste/2025/08/easy-chicken-shawarma-215451-2.jpg"
    },
    {
        "title": "Spanish-style chicken with olives and beans",
        "steps": [
            "Heat a barbecue grill or chargrill on medium. Combine the chicken, paprika and 1 tbs of the reserved marinade from the vegetables in a large bowl. Cook chicken for 3 mins each side or until golden brown and cooked through. Transfer to a plate. Cover with foil to keep warm.",
            "Place the beans, chargrilled vegetables, olives and spinach in a medium bowl. Toss to combine. Transfer to a serving dish. Combine the garlic, oregano and remaining marinade in a small bowl.",
            "Arrange the chicken over the salad in the dish. Drizzle with the oregano mixture to serve."
        ],
        "ingredients": [
            "500g coles rspca approved australian chicken tenderloins",
            "2 tsp smoked paprika",
            "280g jar coles chargrilled vegetables, drained reserving",
            "1/4 cup (60ml) marinade",
            "400g can cannellini beans, rinsed, drained",
            "230g pitted mixed olives, drained",
            "60g baby spinach leaves",
            "1 tsp minced garlic",
            "1 tbsp chopped oregano"
        ],
        "coordinates": [
            -9.316136469885791,
            38.09809226472972
        ],
        "thumbnailUrl": "https://img.taste.com.au/0dEhZfuY/w720-h480-cfill-q80/taste/2020/02/mar20_spanish-style-chicken-with-olives-and-beans-158567-1.jpg"
    },
    {
        "title": "Piroshki (Russian hand pies)",
        "steps": [
            "To make the dough, combine the flour, salt and yeast in a large bowl. Make a well in the centre. Pour in the water and vegetable oil. Stir until just combined. Turn the dough onto a lightly floured surface. Knead for 5 minutes or until smooth and elastic. Place in a large, lightly oiled bowl. Cover with a clean tea towel. Set aside in a warm, draught-free place for 1 hour or until dough doubles in size. Punch down the dough. Knead on a lightly floured surface for 2 minutes or until smooth. Return the dough to the bowl. Cover and set aside in a warm, draught-free place for 30 minutes to prove.",
            "Meanwhile, heat the olive oil and butter in a large frying pan over medium-high heat. Add the onion and garlic. Cook, stirring, for 3-4 minutes or until onion softens. Add the beef and cook, breaking up any lumps with a wooden spoon, for 2-3 minutes or until beef is browned. Add cabbage and carrot. Cook, stirring, for 2-3 minutes or until cabbage wilts. Add dill, paprika and vinegar. Cook for 2 minutes. Season well. Transfer to a large bowl and set aside to cool completely.",
            "Turn dough onto a lightly floured surface. Knead for 1 minute or until smooth. Shape into a 30cm-long log. Cut log into 16 equal portions. Working with 4 portions at a time (cover remaining portions with a clean tea towel), roll each portion out to a 12cm disc. Spoon 2 tablespoonfuls of beef mixture onto 1 half of each disc. Fold over dough to enclose filling, pinching edge to seal. Repeat with remaining dough and beef mixture. 4 Add vegetable oil to a wok or large saucepan to come halfway up side of pan. Heat over medium-high heat. Deep-fry the piroshki, in batches, turning, for 2-3 minutes or until puffed and golden. Use a slotted spoon to transfer to a tray lined with paper towel to drain then serve."
        ],
        "ingredients": [
            "1 tbsp olive oil",
            "10g butter",
            "1 brown onion, finely chopped",
            "2 garlic cloves, crushed",
            "300g beef mince",
            "2 cups shredded savoy cabbage",
            "1 small carrot, peeled, coarsely grated",
            "2 tbsp finely chopped fresh dill leaves",
            "1 tsp masterfoods® paprika ground",
            "2 tsp coles italian red wine vinegar",
            "vegetable oil, to deep-fry",
            "450g (3 cups) plain flour",
            "1 tsp salt",
            "2 tsp (7g sachet) dried yeast",
            "310ml (1 1/4 cups) warm water",
            "1 1/2 tbsp vegetable oil"
        ],
        "coordinates": [
            24.92230064069214,
            59.16026908798463
        ],
        "thumbnailUrl": "https://img.taste.com.au/oxJBqHRh/w720-h480-cfill-q80/taste/2019/06/piroshki-russian-hand-pies-150270-2.jpg"
    },
    {
        "title": "Spice biscuits (Finland)",
        "steps": [
            "Using an electric mixer, beat sugar, egg, golden syrup, cardamom, cinnamon, cloves and bicarbonate of soda until pale and creamy. Slowly add butter, beating until just combined. Sift flour over spice mixture. Stir until dough comes together. Transfer to a lightly floured surface. Knead dough until smooth. Wrap in greaseproof paper. Refrigerate for 30 minutes or until firm.",
            "Preheat oven to 180°C. Line 2 flat baking trays with baking paper. Roll out dough between 2 sheets of baking paper until 5mm thick. Using a 6cm round fluted biscuit cutter, cut shapes out of dough (see hint). Press leftover dough together and repeat. Divide biscuits between baking trays.",
            "Bake biscuits for 10 to 12 minutes, swapping trays after 6 minutes, or until light golden. Allow biscuits to cool on trays for 5 minutes before transferring to a wire rack to cool completely."
        ],
        "ingredients": [
            "1 cup caster sugar",
            "1 egg, at room temperature",
            "2 tbsp golden syrup",
            "2 tsp ground cardamom",
            "1 tsp ground cinnamon",
            "1/2 tsp ground cloves",
            "1 tsp bicarbonate of soda",
            "250g butter, melted, cooled",
            "3 1/2 cups plain flour"
        ],
        "coordinates": [
            27.035815617315674,
            60.01963334259704
        ],
        "thumbnailUrl": "https://img.taste.com.au/LUUmw58K/w720-h480-cfill-q80/taste/2016/11/spice-biscuits-finland-1082-1.jpeg"
    },
    {
        "title": "Rocket, pear and parmesan salad",
        "steps": [
            "Drizzle the pears with a little lemon juice. Place pine nuts in a small frying pan over low heat and cook for 1-2 minutes or until golden. Set aside to cool slightly.",
            "To make the dressing, combine the olive oil and vinegar. Season with salt and cracked black pepper and whisk until well combined.",
            "To serve, combine the rocket, pear, pine nuts and dressing in a large bowl and gently toss to combine. Transfer to a serving bowl and top with shaved parmesan."
        ],
        "ingredients": [
            "2 beurre bosc pears, cored, thinly sliced",
            "lemon juice, to drizzle",
            "2 tbsp pine nuts",
            "1/4 cup olive oil",
            "2 tbsp coles balsamic vinegar",
            "salt and pepper",
            "125g baby rocket leaves",
            "1/4 cup shaved parmesan, to serve"
        ],
        "coordinates": [
            -179.05253336670015,
            -17.878892833294667
        ],
        "thumbnailUrl": "https://img.taste.com.au/H4qDdYgS/w720-h480-cfill-q80/taste/2016/11/rocket-pear-and-parmesan-salad-71126-1.jpeg"
    },
    {
        "title": "Banoffee french toast",
        "steps": [
            "Whisk milk, egg and vanilla in a large shallow bowl. Melt half the butter in a large frying pan over medium-low heat.",
            "Place 2 slices of banana bread in the egg mixture and turn to coat. Allow to soak for 20 secs. Transfer to the frying pan and cook for 1-2 mins each side or until golden brown and heated through. Transfer to a plate and cover to keep warm. Wipe the pan clean. Repeat with the remaining butter, banana bread and egg mixture.",
            "Divide banana bread evenly among serving plates. Spoon the whipped cream evenly over banana bread. Top with banana. Sprinkle with chocolate bar and drizzle with caramel topping."
        ],
        "ingredients": [
            "1/2 cup (125ml) milk",
            "2 coles australian free range eggs, lightly whisked",
            "1 tsp vanilla extract",
            "40g unsalted butter, chopped",
            "4 coles banana bread slices",
            "1/2 cup (125ml) pouring (pure) cream or thickened cream, whipped",
            "2 bananas, thickly sliced",
            "violet crumble chocolate bar, chopped, to serve",
            "coles salted caramel topping, to serve"
        ],
        "coordinates": [
            2.3813662213618425,
            47.05709389783419
        ],
        "thumbnailUrl": "https://img.taste.com.au/6QtqhiYi/w720-h480-cfill-q80/taste/2020/02/mar20_banoffee-french-toast-158615-1.jpg"
    },
    {
        "title": "Gado gado",
        "steps": [
            "Place potatoes in a saucepan and cover with cold water. Bring to the boil over high heat. Reduce heat to medium and cook, covered, for 20 minutes or until tender when pierced with a skewer. Drain. Set aside for 20 minutes to cool.",
            "To make the peanut sauce, place the peanuts and chillies in the bowl of a food processor and process until finely chopped. Heat the oil in a saucepan over medium heat. Add the garlic and ginger and cook, stirring, for 30 seconds or until fragrant. Add the coconut milk, soy sauce, lime or lemon juice, sugar and peanut mixture, and stir to combine. Bring to a simmer. Remove from heat and pour into a heatproof serving bowl.",
            "Cook the asparagus and beans in a medium saucepan of salted boiling water for 2 minutes or until bright green and tender crisp. Drain. Refresh under cold running water. Drain well.",
            "Cut the potatoes lengthways into quarters. Arrange potato, asparagus, beans, bean sprouts, cucumber, tofu, egg and tomato on serving plates. Serve immediately with the peanut sauce."
        ],
        "ingredients": [
            "2 large desiree potatoes,unpeeled, washed",
            "12 asparagus spears, ends trimmed",
            "12 long green beans, topped, halved crossways",
            "65g (1 cup) bean sprouts",
            "1 lebanese cucumber, halved, cut into batons",
            "100g firm marinated thai-style tofu (soyco brand), drained",
            "2 hard-boiled eggs, peeled, quartered",
            "2 ripe tomatoes, each cut into 6 wedges",
            "peanut sauce",
            "40g (1/3 cup) crushed peanuts",
            "1-2 small fresh red birdseye chilli",
            "chillies, deseeded",
            "1 tsp light olive oil",
            "1 garlic clove, crushed",
            "1 tsp finely grated fresh ginger",
            "80ml (1/3 cup) light coconut milk",
            "1 tbsp soy sauce",
            "2 tsp fresh lime juice or lemon juice",
            "1 tsp brown sugar"
        ],
        "coordinates": [
            11.623150777846728,
            -3.209166879669596
        ],
        "thumbnailUrl": "https://img.taste.com.au/1xRDPLx6/w720-h480-cfill-q80/taste/2016/11/gado-gado-5777-1.jpeg"
    },
    {
        "title": "5-ingredient cheesy Mexican stuffed chicken breasts",
        "steps": [
            "Preheat oven to 190C/170C fan-forced. Drain peppers, reserving 1 tbsp marinating oil. Slice peppers.",
            "Cut slits into each chicken breast, about 1 1/2cm apart, being careful not to cut the whole way through. Push peppers and coriander leaves into the cuts.",
            "Reserve 1/4 cup salsa. Stir water into remaining salsa and spoon over the base of a greased 21cm x 35cm roasting pan. Arrange chicken breasts on top. Drizzle with reserved oil and season.",
            "Bake chicken for 15 minutes. Drizzle chicken with reserved salsa and top with cheese slices (breaking where needed to completely cover top of breasts). Bake for 15 minutes or until cheese is melted and chicken is cooked through. Serve sprinkled with coriander sprigs."
        ],
        "ingredients": [
            "280g jar mixed chargrilled peppers",
            "4 chicken breast fillets",
            "1/2 cup firmly packed coriander leaves",
            "300g jar coles mexico salsa roja",
            "2 tbsp water",
            "4 slices coles finest british chilli cheddar slices, halved",
            "coriander sprigs, to serve"
        ],
        "coordinates": [
            -0.7046029014410768,
            55.50911049119257
        ],
        "thumbnailUrl": "https://img.taste.com.au/MwLydvdJ/w720-h480-cfill-q80/taste/2025/06/5-ingredient-mexican-chicken-hero-212760-1.jpg"
    },
    {
        "title": "Black bean nachos cob",
        "steps": [
            "Preheat oven to 180C/160C fan forced. Line 2 baking trays with baking paper.",
            "Use a bread knife to cut the top third from the cob loaf. Scoop out the bread inside, leaving a 2cm-thick shell. Cut the top of the cob and the bread from inside into small triangles. Place on a prepared tray. Drizzle with olive oil and season.",
            "Combine the black beans, tomato, onion and two-thirds of the mozzarella in a bowl. Sprinkle with the cumin and season. Spoon the mixture into the cob. Sprinkle with the remaining mozzarella.",
            "Place the cob on the remaining prepared tray. Bake the cob and bread triangles for 20 minutes or until the cheese is melted and bread triangles are golden brown.",
            "Spoon the sour cream on top of the bean mixture. Sprinkle with jalapeño and fresh coriander. Serve with the bread triangles."
        ],
        "ingredients": [
            "1 rye cob loaf or multigrain cob loaf",
            "2 tbsp extra virgin olive oil",
            "400g can black beans, rinsed, drained",
            "3 ripe tomatoes, finely chopped",
            "1/2 red onion, finely chopped",
            "220g mozzarella, coarsely grated",
            "1 tbsp ground cumin",
            "190g (3/4 cup) sour cream",
            "sliced pickled jalapeño, to serve",
            "fresh coriander leaves, to serve"
        ],
        "coordinates": [
            46.07682413525953,
            42.28376665565259
        ],
        "thumbnailUrl": "https://img.taste.com.au/-kkTKqUD/w720-h480-cfill-q80/taste/2017/10/black-bean-nachos-cob-131889-1.jpg"
    },
    {
        "title": "Root vegetable cottage pie",
        "steps": [
            "Preheat oven to 190C. Place the chopped potatoes and parsnip in a large saucepan and fill with enough water to cover. Add salt and bring to the boil. Cook until both are tender and good for mashing, about 20 minutes. Strain in a colander and set colander over the hot saucepan to allow the vegetables to steam dry.",
            "Working in batches, pass the potatoes and parsnip through a ricer or food mill and into a large bowl. (Alternatively use a potato masher).",
            "Heat the milk and butter in a small saucepan over a low heat until the butter has melted and the milk is hot but not scalding. Pour just enough of the warm milk and butter mixture into the bowl and whisk until the mash has a creamy consistency, discarding any remaining milk mixture. Season to taste with salt and pepper.",
            "Meanwhile, heat the 1 tablespoon of oil in a large frying pan over a medium-high heat and cook the beef until browned and just cooked through, breaking up any large chunks. Season to taste with salt and pepper.",
            "Strain the beef from the pan and reserve on the side. Return the pan to the heat.",
            "Add the onion and cook for 1 minute, then add the garlic to the pan and cook for 3 minutes or until translucent.",
            "Add the carrots and thyme and cook for 1 minute, then add the pumpkin to the pan and cook for 4 minutes stirring occasionally.",
            "Add the tomato paste and stir to coat the vegetables, cook for 2-3 minutes being careful not to scorch the tomato paste.",
            "Add the beef back to the pan and stir well to mix, then add the beef stock, stir well and bring to a simmer. Reduce heat and cook covered, stirring occasionally for 15-20 minutes or until the sauce thickens. Season to taste with salt and pepper.",
            "Pour the mixture into 4 small individual baking dishes or ramekins and prepare the mash.",
            "Place the mash into a pastry bag and pipe over the filling in a decorative pattern or spoon the mash over the filling and using a fork make cross hatch marks or swirls. Brush the top of each cottage pie with melted butter and place on a baking tray and into the oven.",
            "Bake for 15-20 minutes or until the tops are golden brown and the filling is heated through.",
            "Remove from the oven and allow the pies to sit at room temperature for 5 minutes before serving."
        ],
        "ingredients": [
            "450g brushed potatoes, peeled, cut into 3cm chunks",
            "1 medium parsnip, peeled, cut into 1cm disks",
            "1 tbsp coles olive oil",
            "500g coles beef mince 3 star",
            "1 small brown onion, roughly chopped",
            "2 cloves garlic, finely chopped",
            "1 tbsp fresh thyme, chopped",
            "1 medium carrot, peeled and cut into 1/2 cm dice",
            "1 1/2 cups butternut pumpkin, peeled and cut into 1/2 cm dice",
            "2 tbsp coles tomato paste",
            "1 1/2 cups campbell's real beef stock",
            "3/4 cup coles milk",
            "1 tbsp coles unsalted butter",
            "melted butter, for brushing"
        ],
        "coordinates": [
            -13.233378404456513,
            9.769816337561323
        ],
        "thumbnailUrl": "https://img.taste.com.au/3KlRInEs/w720-h480-cfill-q80/taste/2016/11/root-vegetable-cottage-pie-89764-1.jpeg"
    },
    {
        "title": "Greek-style braised lamb",
        "steps": [
            "Heat a large frying pan over high heat. Add lamb and cook for 2 mins each side or until browned. Transfer to a plate and cover with foil to keep warm.",
            "Add the onion and garlic to the pan. Cook, stirring, for 5 mins or until the onion is soft. Return lamb to the pan with tomatoes and olives. Season. Bring to the boil. Reduce heat to low. Cook for 5 mins or until the lamb is cooked through.",
            "Meanwhile, heat the mash following packet directions.",
            "Divide the lamb mixture and mash among serving plates. Sprinkle with oregano."
        ],
        "ingredients": [
            "8 coles graze lamb loin chops",
            "1 brown onion, thinly sliced",
            "1 garlic clove, thinly sliced",
            "2 x 400g cans cherry tomatoes",
            "1/3 cup (55g) pitted kalamata olives",
            "2 x 250g tubs coles cheddar mash",
            "2 tbsp oregano leaves"
        ],
        "coordinates": [
            20.592277742842413,
            40.933238529825005
        ],
        "thumbnailUrl": "https://img.taste.com.au/BzG5KFJF/w720-h480-cfill-q80/taste/2020/05/greek-style-braised-lamb-recipe-161683-2.jpg"
    },
    {
        "title": "Sesame tofu, chicken & miso soup",
        "steps": [
            "Preheat grill on high. Toss the tofu in sesame seeds to coat. Place tofu on a baking tray. Cook under preheated grill, about 5cm from heat source, for 1-2 minutes or until sesame seeds are toasted. Remove from grill and set aside.",
            "Combine the soup mix and boiling water in a medium saucepan over low heat. Add the corn, spring onions and soy sauce, and simmer, stirring occasionally, for 2-3 minutes or until heated through.",
            "To serve, ladle soup into serving bowls and top with sesame tofu and spring onion stems."
        ],
        "ingredients": [
            "300g firm tofu, drained, cut into 1.5cm squares",
            "2 tbsp sesame seeds",
            "2 35g pkts asian chicken & miso cup-a-soup (continental brand)",
            "800ml boiling water",
            "1 425g can baby corn (greenland brand), drained, diagonally sliced",
            "3 spring onion bulbs, cut into quarters",
            "2 tsp soy sauce",
            "2 spring onion stems, thinly sliced lengthways"
        ],
        "coordinates": [
            -26.67796945289291,
            60.27952223862084
        ],
        "thumbnailUrl": "https://img.taste.com.au/peljlAkL/w720-h480-cfill-q80/taste/2016/11/sesame-tofu-chicken-miso-soup-21362-1.jpeg"
    },
    {
        "title": "Giant air fryer potato rosti",
        "steps": [
            "Combine potato and salt in a bowl. Spray an air fryer basket with oil. Spread with the grated potato, pressing to the edges. Air fry at 200C for 25-30 minutes. Cool in the basket for 5 minutes before inverting onto a serving plate.",
            "To make topping 1, spread potato rosti base with sour cream and arrange smoked salmon on top. Finish with a scatter of chives.",
            "To make topping 2, scatter the potato rosti base with cheese and place under a hot oven grill for 5 minutes or until melted. Top with a generous spoonful of mashed avo, capsicum, black beans and a dollop of sour cream. Finish with a sprinkle of manchego, if desired. Serve with fresh lime wedges.",
            "To make topping 3, scatter the potato rosti base with the cheeses and place under a hot oven grill for 5 minutes or until melted. Pan-fry eggs and bacon and arrange on top.",
            "To make topping 4, dollop the potato rosti base with the French onion dip and scatter with shallot."
        ],
        "ingredients": [
            "750g washed desiree potatoes, peeled, coarsely grated",
            "1/2 tsp sea salt",
            "200g smoked salmon",
            "100g sour cream",
            "1 tbsp finely chopped chives",
            "35g (1/3 cup) grated cheddar or mexican cheese blend",
            "1/2 avocado, mashed",
            "30g chargrilled red capsicum, finely diced",
            "2 tbsp drained black beans",
            "2 tbsp sour cream",
            "grated manchego cheese, to serve (optional)",
            "lime wedges, to serve",
            "50g haloumi, grated",
            "50g mozzarella, grated",
            "25g parmesan, grated",
            "2 eggs",
            "5-6 rashers streaky bacon, rind removed",
            "1/2 tub french onion dip",
            "1 green shallot, finely sliced"
        ],
        "coordinates": [
            -53.55101089221796,
            4.222066585552697
        ],
        "thumbnailUrl": "https://img.taste.com.au/yG01H3Ye/w720-h480-cfill-q80/taste/2021/08/giant-air-fryer-potato-rosti-172994-2.jpg"
    },
    {
        "title": "Guava fizzer",
        "steps": [
            "Pour 1/4 cup nectar into each glass.",
            "Top with wine. Serve."
        ],
        "ingredients": [
            "2 cups chilled guava nectar",
            "2 x 750ml bottles chilled sparkling white wine"
        ],
        "coordinates": [
            -57.14654631261587,
            5.543803528406219
        ],
        "thumbnailUrl": "https://img.taste.com.au/0tuQUjP9/w720-h480-cfill-q80/taste/2016/11/guava-fizzer-38080-1.jpeg"
    },
    {
        "title": "Croatian kiflice biscuits",
        "steps": [
            "Line a large baking tray with baking paper.",
            "With a hand mixer, combine the egg yolks and sugar in a bowl.",
            "Add butter, rum (if using), vanilla essence, lemon zest, sour cream, baking powder and combine well.",
            "Slowly add the flour, 1 cup at a time, until you have a dough ball, and it’s sticky and light in colour (you may not need the full 500g).",
            "Wrap dough in cling film and place in the fridge for 30 mins. After 30 mins, remove your dough and preheat your oven to 180C.",
            "On a dusted workbench, divide your dough into three equal portions, dust with flour and roll out into a circle the size of a dinner plate. Using a pizza cutter, slice your dough into 8-10 equal triangle-shaped portions.",
            "At the wide end of the triangle, place a dollop of jam, tuck in the sides and then roll down towards the point. They will look a bit like a croissant.",
            "Place on a tray and bake for 15-20 mins, or until golden brown. Serve, dusted with icing sugar."
        ],
        "ingredients": [
            "3 egg yolks",
            "1 cup white sugar",
            "250g unsalted butter, softened",
            "2 tbsp dark rum (optional)",
            "1/3 tsp vanilla essence",
            "1 lemon, zested",
            "1 cup sour cream",
            "1 tsp baking powder",
            "500g all-purpose flour, plus extra for dusting",
            "podravka plum jam (sour plum jam, see note)",
            "icing sugar, to serve"
        ],
        "coordinates": [
            15.687197437564901,
            44.85674813207232
        ],
        "thumbnailUrl": "https://img.taste.com.au/UEO8N3cF/w720-h480-cfill-q80/taste/2020/09/croatian-kiflice-biscuits-164951-2.jpg"
    },
    {
        "title": "Raspberry queen of puddings",
        "steps": [
            "Preheat oven to 160°C/140°C fan-forced. Grease a 6cm-deep, 30cm x 22cm (base) baking dish. Arrange cake over base.",
            "Place cream and milk in a saucepan over medium heat. Cook, stirring, for 4 to 5 minutes or until almost boiling. Whisk eggs, egg yolks, vanilla and 1/2 cup sugar together in a bowl. Whisk in hot milk mixture. Pour mixture over cake. Bake for 45 minutes or until just set. Cool for 15 minutes. Top with jam. Sprinkle with raspberries.",
            "Increase oven temperature to 200°C/180°C fan-forced. Using an electric mixer, beat eggwhites until soft peaks form. Beat in remaining sugar, 1 tablespoon at a time, until sugar dissolves and mixture is thick and glossy. Spread over raspberries. Bake for 15 minutes or until golden. Serve."
        ],
        "ingredients": [
            "230g sponge cake, cut into 3cm pieces (see note)",
            "1 3/4 cups thickened cream",
            "1 1/2 cups milk",
            "3 eggs",
            "4 eggs, separated",
            "1 tsp vanilla extract",
            "1 1/2 cups caster sugar",
            "1/2 cup raspberry jam",
            "300g frozen raspberries, thawed (see tip)"
        ],
        "coordinates": [
            -71.64077605418471,
            18.808759923989125
        ],
        "thumbnailUrl": "https://img.taste.com.au/_VuOjBbJ/w720-h480-cfill-q80/taste/2016/11/raspberry-queen-of-puddings-76365-1.jpeg"
    },
    {
        "title": "Broccoli and Brussels sprouts with salami crumbs and pan-fried chicken",
        "steps": [
            "Preheat oven to 220C (200C fan-forced).",
            "Process the bread, half the salami and half the sage with 1 tablespoon of the oil in a food processor until coarse crumbs form.",
            "Toss the broccoli, brussels sprouts and onion with the remaining salami, sage and oil in a large bowl. Season. Arrange in a single layer in a large roasting pan. Roast for 25 mins or until the broccoli is almost tender.",
            "Preheat grill on high. Sprinkle the salami crumbs over the roasted vegetables. Cook under grill for 5 mins or until golden. Serve with chicken."
        ],
        "ingredients": [
            "60g ciabatta, coarsely chopped",
            "100g mild hungarian salami, from the deli, finely chopped",
            "1/4 cup sage leaves",
            "1/4 cup olive oil",
            "350g broccoli, trimmed, cut into 2cm-thick slices",
            "300g brussels sprouts, trimmed, halved",
            "1/4 brown onion, thinly sliced",
            "pan-fried coles rspca approved chicken breast fillets, thickly sliced, to serve"
        ],
        "coordinates": [
            21.828682244567503,
            48.60767948673356
        ],
        "thumbnailUrl": "https://img.taste.com.au/WoKWmTmy/w720-h480-cfill-q80/taste/2016/11/broccoli-and-brussels-sprouts-with-salami-crumbs-and-pan-fried-chicken-96478-1.jpeg"
    },
    {
        "title": "Nasi goreng",
        "steps": [
            "Place rice in a large saucepan. Cover with 1 1/2 cups water. Place over high heat and bring to the boil. Reduce heat to low and cook, covered, for 12 mins or until tender and water is absorbed. Set aside, covered, for 5 mins. Spread over a baking tray. Chill for 4 hrs or overnight.",
            "Heat half the oil in a wok over high heat. Crack in 1 egg. Cook for 2 mins or until cooked to your liking. Transfer to a plate. Repeat with remaining eggs.",
            "Heat the remaining oil in wok over high heat until smoking. Add the onion, garlic and sambal oelek. Stir-fry for 1 min or until fragrant. Add celery, carrot and peas and stir-fry for 2 mins or until heated through. Add rice and stir-fry for 5 mins or until heated through. Add kecap manis and stir-fry for 2 mins or until heated through and well combined.",
            "Divide rice among bowls. Sprinkle with cucumber and tomato. Top with fried eggs and coriander."
        ],
        "ingredients": [
            "1 cup coles brand jasmine rice, rinsed",
            "2 tbsp coles brand peanut oil",
            "4 eggs",
            "2 spring onions, thinly sliced",
            "2 garlic cloves, crushed",
            "2 tsp sambal oelek (chilli paste – optional)",
            "2 celery sticks, finely chopped",
            "1 large carrot, finely chopped",
            "1 cup frozen peas",
            "2 tbsp kecap manis (sweet soy sauce)",
            "1 lebanese cucumber, finely chopped",
            "1 medium ripe field tomato, finely chopped",
            "1/2 cup coriander leaves"
        ],
        "coordinates": [
            121.30011561398956,
            -1.0476329615268813
        ],
        "thumbnailUrl": "https://img.taste.com.au/pnBdhxoo/w720-h480-cfill-q80/taste/2016/11/nasi-goreng-93571-1.jpeg"
    },
    {
        "title": "Indian style lamb koftas with Asian salad",
        "steps": [
            "Finely chop 1 cup coriander leaves. Use your hands to combine mince, chopped coriander, chopped onion and garam masala in a large bowl. Divide into 12 even portions and mould around pre-soaked bamboo skewers. Heat a chargrill on medium-high and brush with half the oil. Cook koftas on grill, turning occasionally, for 8 minutes or until cooked through.",
            "Meanwhile, toss remaining coriander, sliced onion, salad mix and remaining oil in a medium bowl until combined.",
            "Divide salad and koftas among plates. Serve with the sauce and lemon wedges."
        ],
        "ingredients": [
            "2 cups coriander leaves, loosely packed",
            "500 g coles australian lamb mince",
            "1 red onion, half finely chopped, half finely sliced",
            "2 tsp garam masala",
            "2 tbsp olive oil",
            "400g pkt coles brand asian salad or stir-fry",
            "1/2 cup alana's pantry spicy india sauce",
            "lemon wedges, to serve"
        ],
        "coordinates": [
            93.22272128060253,
            19.08181626584812
        ],
        "thumbnailUrl": "https://img.taste.com.au/DALC8QT0/w720-h480-cfill-q80/taste/2016/11/indian-style-lamb-koftas-with-asian-salad-107984-1.jpeg"
    },
    {
        "title": "Irish stew recipe",
        "steps": [
            "Cut chops in half. Place flour in a plastic bag and season with salt and pepper. Place chops in bag and shake well to coat. Transfer chops to a plate. Reserve flour.",
            "Preheat oven to 130°C. Place onions, potatoes and carrots in an ovenproof dish. Top with half the chops. Repeat layers with remaining onions, potatoes, carrots and chops.",
            "Whisk reserved flour, tomato paste and 2 tablespoons cold water in a large jug until well combined. Slowly add boiling water, whisking constantly. Add stock cubes and parsley. Stir to dissolve stock cubes.",
            "Pour flour mixture over chops. Cover and cook for 4 hours or until meat tender and sauce thickened. Sprinkle with mint and serve."
        ],
        "ingredients": [
            "1.25kg lamb neck chops, trimmed",
            "1/2 cup plain flour",
            "3 brown onions, chopped",
            "1kg sebago potatoes, peeled, sliced",
            "2 carrots, peeled, thinly sliced into rounds",
            "2 tbsp coles tomato paste",
            "3 cups boiling water",
            "3 beef stock cubes",
            "1 cup flat-leaf parsley leaves, chopped",
            "1/4 cup mint leaves, chopped, to serve"
        ],
        "coordinates": [
            -9.492468022223475,
            52.461269856436246
        ],
        "thumbnailUrl": "https://img.taste.com.au/6iXq_Ukt/w720-h480-cfill-q80/taste/2016/11/irish-stew-27537-1.jpeg"
    },
    {
        "title": "Molten cheese with fire-roasted chillies and Mexican chorizo",
        "steps": [
            "To fire-roast the chillies, pre-heat the barbecue for high heat. Coat all the chillies with the oil and season with salt. Grill the chillies, turning frequently, for about 10 minutes, or until they are evenly blistered and softened. Place the chillies in a bowl, cover with plastic wrap, and set aside until cool enough to handle. Remove as much peel and seeds from the chillies as possible, then slice the chillies lengthways.",
            "Meanwhile, to make the chorizo, in a medium bowl, mix the pork, vinegar, garlic, chili powder, and salt. Heat a 20cm cast-iron pan or small heavy pan over medium-high heat. Add the oil and then the pork mixture and cook, stirring frequently to break up the pork into small pieces, for about 4-5 minutes, or until beginning to brown and cooked through. Transfer the chorizo to a small bowl and cover to keep warm.",
            "To make the molten cheese and serve, wipe out the pan and return it to medium-low heat. Add the cheeses, sliced roasted chillies, lime juice, and 1/2 teaspoon of salt. Using a wooden spoon, stir the cheese mixture constantly over medium heat for about 5 minutes, or until the cheese is melted and sauce-like.",
            "Sprinkle some of the chorizo over the hot molten cheese. Serve immediately, passing the coriander, avocado, sour cream, tortillas, and remaining chorizo alongside and encouraging everyone to assemble their tacos with the accompaniments."
        ],
        "ingredients": [
            "4 long red chillies",
            "4 yellow bullhorn chillies",
            "2 long green chillies",
            "1 tsp olive oil",
            "175g coon tasty cheese, grated",
            "175g mozzarella cheese, grated",
            "juice of 1 lime",
            "300g coles pork mince",
            "3 tbsp apple cider vinegar",
            "2 cloves garlic, crushed",
            "2 tbsp coles brand mild mexican chilli powder",
            "1 1/2 tsp fine sea salt",
            "2 tbsp coles olive oil",
            "10 sprigs fresh coriander, tender stems and leaves only",
            "1 ripe avocado, peeled, pitted, sliced",
            "1/2 cup coles brand sour cream",
            "8 flour or corn tortillas, warmed"
        ],
        "coordinates": [
            57.09012472035289,
            32.93712836744649
        ],
        "thumbnailUrl": "https://img.taste.com.au/V31yCswP/w720-h480-cfill-q80/taste/2016/11/molten-cheese-with-fire-roasted-chillies-and-mexican-chorizo-93149-1.jpeg"
    },
    {
        "title": "Molten cheese with fire-roasted chillies and Mexican chorizo",
        "steps": [
            "To fire-roast the chillies, pre-heat the barbecue for high heat. Coat all the chillies with the oil and season with salt. Grill the chillies, turning frequently, for about 10 minutes, or until they are evenly blistered and softened. Place the chillies in a bowl, cover with plastic wrap, and set aside until cool enough to handle. Remove as much peel and seeds from the chillies as possible, then slice the chillies lengthways.",
            "Meanwhile, to make the chorizo, in a medium bowl, mix the pork, vinegar, garlic, chili powder, and salt. Heat a 20cm cast-iron pan or small heavy pan over medium-high heat. Add the oil and then the pork mixture and cook, stirring frequently to break up the pork into small pieces, for about 4-5 minutes, or until beginning to brown and cooked through. Transfer the chorizo to a small bowl and cover to keep warm.",
            "To make the molten cheese and serve, wipe out the pan and return it to medium-low heat. Add the cheeses, sliced roasted chillies, lime juice, and 1/2 teaspoon of salt. Using a wooden spoon, stir the cheese mixture constantly over medium heat for about 5 minutes, or until the cheese is melted and sauce-like.",
            "Sprinkle some of the chorizo over the hot molten cheese. Serve immediately, passing the coriander, avocado, sour cream, tortillas, and remaining chorizo alongside and encouraging everyone to assemble their tacos with the accompaniments."
        ],
        "ingredients": [
            "4 long red chillies",
            "4 yellow bullhorn chillies",
            "2 long green chillies",
            "1 tsp olive oil",
            "175g coon tasty cheese, grated",
            "175g mozzarella cheese, grated",
            "juice of 1 lime",
            "300g coles pork mince",
            "3 tbsp apple cider vinegar",
            "2 cloves garlic, crushed",
            "2 tbsp coles brand mild mexican chilli powder",
            "1 1/2 tsp fine sea salt",
            "2 tbsp coles olive oil",
            "10 sprigs fresh coriander, tender stems and leaves only",
            "1 ripe avocado, peeled, pitted, sliced",
            "1/2 cup coles brand sour cream",
            "8 flour or corn tortillas, warmed"
        ],
        "coordinates": [
            39.829007369903636,
            33.249251767980056
        ],
        "thumbnailUrl": "https://img.taste.com.au/V31yCswP/w720-h480-cfill-q80/taste/2016/11/molten-cheese-with-fire-roasted-chillies-and-mexican-chorizo-93149-1.jpeg"
    },
    {
        "title": "Creamy chicken Carbonara recipe",
        "steps": [
            "Cook the  Brand Penne in a saucepan of boiling water following packet directions. Drain.",
            "Meanwhile, heat the  Australian Extra Virgin Olive Oil in a frying pan over medium heat. Add chicken and cook for 4 mins, turning, until golden and cooked through. Transfer to a plate. Add bacon to the pan and cook, stirring, for 2 mins or until golden and starting to crisp.",
            "Whisk garlic,  Real Stock Chicken, egg yolks, cream, cornflour and half (20g) of the parmesan in a bowl. Season. Return the chicken to the pan over low heat. Add the egg mixture and pasta. Cook, tossing, for 1-2 mins or until pasta is coated and the sauce thickens. Top with parsley and remaining parmesan."
        ],
        "ingredients": [
            "500g coles brand penne",
            "1 tbsp red island australian extra virgin olive oil",
            "500g coles rspca approved chicken breast fillets, cut into 2cm pieces",
            "250g short-cut bacon rashers, sliced",
            "2 garlic cloves, crushed",
            "1 cup (250ml) campbell's real stock chicken",
            "2 coles brand australian free range egg yolks",
            "3/4 cup (185ml) thickened cream",
            "1 tbsp coles cornflour",
            "1/2 cup (40g) parmesan, finely grated",
            "2 tbsp flat-leaf parsley, chopped"
        ],
        "coordinates": [
            -17.98042695585834,
            63.769791120059466
        ],
        "thumbnailUrl": "https://img.taste.com.au/7tmZxaTe/w720-h480-cfill-q80/taste/2016/03/creamy-chicken-carbonara-202215-1.jpg"
    },
    {
        "title": "Italian-style sausage pasta",
        "steps": [
            "Cook the pasta in a large saucepan of boiling water following packet directions or until al dente. Drain, reserving ½ cup (125ml) cooking liquid.",
            "Meanwhile, heat a large frying pan over medium heat. Add the sausage and cook, stirring with a wooden spoon to break up lumps, for 5 mins or until golden brown.",
            "Add the chargrilled vegetables, reserved oil from the vegetables, pasta, reserved cooking water and ¾ cup (65g) of the parmesan to the pan. Toss to combine.",
            "Divide the pasta mixture among serving bowls. Sprinkle with the remaining parmesan and basil. Season."
        ],
        "ingredients": [
            "375g fettuccine",
            "560g coles herb & garlic beef sausages, casings removed",
            "2 x 280g jars coles chargrilled vegetables, drained reserving 1/3 cup (80ml) oil",
            "1 cup (80g) finely grated parmesan",
            "1/2 cup basil leaves"
        ],
        "coordinates": [
            16.322460843303425,
            45.266945502643836
        ],
        "thumbnailUrl": "https://img.taste.com.au/TmbGmkqi/w720-h480-cfill-q80/taste/2019/02/italian-style-sausage-pasta-147324-1.jpg"
    },
    {
        "title": "Jerk chicken and slaw",
        "steps": [
            "Heat a barbecue grill or chargrill on medium. Spray the chicken with olive oil spray. Cook for 4 mins each side or until golden brown and cooked through. Transfer to a plate and cover with foil. Set aside for 5 mins to rest.",
            "Prepare the salad kit in a large bowl following packet directions, reserving the dressing. Top with the avocado. Drizzle with half the reserved dressing.",
            "Cut 1 lime in half. Drizzle over the salad. Cut the remaining lime into wedges or cheeks.",
            "Divide the chicken and salad among serving plates. Drizzle with the remaining dressing and sprinkle with coriander. Season. Serve with lime checks."
        ],
        "ingredients": [
            "1 pkt coles chicken thighs with jamaican jerk",
            "350g pkt coles special burger slaw kit",
            "1 avocado, stoned, peeled, sliced",
            "3 limes",
            "coriander sprigs, to serve"
        ],
        "coordinates": [
            -76.21551691703293,
            18.046525154761465
        ],
        "thumbnailUrl": "https://img.taste.com.au/KjytxPuc/w720-h480-cfill-q80/taste/2020/08/jerk-chicken-slaw-164264-2.jpg"
    },
    {
        "title": "Japanese-style seafood hotpot",
        "steps": [
            "Bring the stock, soy sauce, mirin, garlic and ginger to the boil in a large saucepan over medium-high heat. Add the carrot. Cover and cook for 5 mins. Add the zucchini and noodles. Cook, partially covered, for 2 mins or until the carrot and zucchini are just tender.",
            "Add edamame or broad beans, corn, marinara mix and fish to the pan. Cook, partially covered, for 3-4 mins or until the noodles and vegetables are tender and the seafood is cooked through.",
            "Transfer 1 cup (250ml) of the cooking liquid to a heatproof bowl with the miso paste. Whisk to combine. Add to the pan and cook, stirring, for 1 min or until well combined and heated through.",
            "Divide the seafood hotpot among serving bowls. Sprinkle with spring onion."
        ],
        "ingredients": [
            "2 cups (500ml) fish stock",
            "2 tbsp coles asia soy sauce",
            "1 tbsp mirin seasoning",
            "1 garlic clove, crushed",
            "1 tsp finely grated ginger",
            "1 carrot, peeled, thinly sliced",
            "1 zucchini, thinly sliced",
            "440g pkt udon noodles",
            "200g peeled thawed edamame or broad beans",
            "410g can baby corn, rinsed, drained",
            "300g thawed seafood marinara mix",
            "300g firm white fish fillets, cut into 2cm pieces",
            "2 tbsp miso paste",
            "sliced spring onion, to serve"
        ],
        "coordinates": [
            143.75713893367265,
            34.737675750162275
        ],
        "thumbnailUrl": "https://img.taste.com.au/fFVLCf1I/w720-h480-cfill-q80/taste/2020/05/jun20_japanese-seafood-hotpot-161712-1.jpg"
    },
    {
        "title": "Chicken mince keema curry",
        "steps": [
            "Cook the rice using the absorption method, following packet directions.",
            "Meanwhile, heat the oil in a large frying pan over medium-high heat. Add the onion and cook, stirring occasionally, for 5 minutes or until soft. Add the chicken. Cook, breaking up lumps with a wooden spoon, for 5 minutes or until browned.",
            "Add the curry powder, ginger and garlic to the pan. Cook for 1 minute or until aromatic. Stir in the tomato paste, then the broccoli and sweet potato. Stir in the coconut milk, stock cube and 125ml (½ cup) water. Cook, stirring occasionally, for 10 minutes or until chicken is cooked through and vegetables are tender, adding peas halfway through cooking. Stir in chopped coriander.",
            "Divide rice and curry among serving bowls. Top with yoghurt and coriander sprigs to serve."
        ],
        "ingredients": [
            "300g (1 1/2 cups) basmati rice",
            "2 tbsp vegetable oil",
            "1 brown onion, coarsely chopped",
            "500g pkt coles 100% chicken mince",
            "1 tbsp keen's traditional curry powder",
            "2cm-piece fresh ginger, peeled, finely grated",
            "2 garlic cloves, crushed",
            "2 tbsp coles simply tomato paste",
            "150g broccoli, cut into small florets",
            "1 small (about 250g) sweet potato, peeled, chopped",
            "400ml can coconut milk",
            "1 vegetable stock cube, crumbled",
            "120g (3/4 cup) coles simply snap frozen peas",
            "1 tbsp chopped fresh coriander leaves, plus extra sprigs, to serve",
            "90g (1/3 cup) plain greek-style yoghurt"
        ],
        "coordinates": [
            41.69058197304429,
            -3.4246317757281592
        ],
        "thumbnailUrl": "https://img.taste.com.au/Biv8RoZJ/w720-h480-cfill-q80/taste/2024/02/chicken-mince-keema-curry-195378-1.jpg"
    },
    {
        "title": "Cambodian coconut beef curry",
        "steps": [
            "Heat the oil in a large, deep frying pan over medium-high heat. Add the meatballs and cook, turning, for 3 minutes or until browned all over. Transfer to a plate",
            "Add the curry paste to the pan (see tip) and cook, stirring, for 30 seconds or until aromatic. Add the coconut milk, coconut cream and cinnamon. Bring to the boil then reduce the heat. Add the meatballs and simmer, turning occasionally, for 10 minutes or until the meatballs are cooked through and the sauce thickens slightly. Stir in the peas and season",
            "Combine the almonds, shredded coconut and chilli in a bowl. Warm the rice following packet directions. Top the curry with the coconut mixture, shallot and coriander. Serve with rice and roti."
        ],
        "ingredients": [
            "1 tbsp vegetable oil",
            "24 bought beef meatballs",
            "120g (1/2 cup) red curry paste",
            "400ml can coconut milk",
            "400ml can coconut cream",
            "1 cinnamon stick",
            "270g (1 1/2 cups) frozen baby peas, thawed",
            "35g (1/3 cup) flaked almonds, toasted",
            "25g (1/3 cup) shredded coconut, toasted",
            "1 long fresh green chilli, finely chopped",
            "2 x 250g pkt microwave 7 ancient grains rice",
            "thinly sliced green shallots, to serve",
            "fresh coriander sprigs, to serve",
            "warmed garlic roti, to serve"
        ],
        "coordinates": [
            103.71422010184573,
            12.19922144534768
        ],
        "thumbnailUrl": "https://img.taste.com.au/WfKb5fn-/w720-h480-cfill-q80/taste/2020/05/cambodian-coconut-beef-curry-161653-2.jpg"
    },
    {
        "title": "Air-fried milk",
        "steps": [
            "Grease and line a 20cm x 30cm lamington pan with baking paper.",
            "Place milk, cinnamon and lemon rind in a medium saucepan and bring to a simmer over medium heat.",
            "Whisk eggs, yolks, caster sugar, cornflour and vanilla in a large bowl until well combined. Strain milk mixture over egg mixture and whisk until combined. Discard cinnamon sticks and rind.",
            "Return milk mixture to a cleaned medium saucepan. Cook, stirring constantly, over medium-low heat for 5 minutes or until mixture bubbles and thickens (see note).",
            "Pour milk mixture into prepared pan and smooth top. Cool completely and place in fridge for 3 hours or until firm.",
            "Turn milk mixture out onto a chopping board. Cut into 3.5cm squares. Coat each square in flour, shaking off excess.",
            "Spray the basket of an air fryer with oil. Add some milk squares to fryer and spray with oil. Cook on 200C for 10 minutes or until golden. Repeat with remaining milk squares.",
            "Sprinkle milk squares with cinnamon sugar and serve."
        ],
        "ingredients": [
            "1.2l milk",
            "2 cinnamon sticks",
            "2 strips lemon rind",
            "4 eggs",
            "2 egg yolks",
            "215g (1 cup) caster sugar",
            "140g (1 cup) cornflour",
            "2 tsp vanilla extract",
            "120g (3/4 cup) plain flour",
            "cinnamon sugar, to sprinkle"
        ],
        "coordinates": [
            129.01436222893818,
            36.06410470754329
        ],
        "thumbnailUrl": "https://img.taste.com.au/Cskj1_ro/w720-h480-cfill-q80/taste/2022/06/air-fried-milk-recipe-179036-1.jpg"
    },
    {
        "title": "Lamb kofta",
        "steps": [
            "Place mince, onion, garlic, chilli flakes, mint, parsley, paprika, ginger, cumin and coriander in a bowl. Mix to combine.",
            "Shape 1/4 cup lamb mixture at a time into sixteen 8cm-long sausages. Thread 1 sausage onto each skewer. Place on a large baking tray. Cover. Refrigerate for 20 minutes or until firm.",
            "Heat an oiled barbecued plate on high. Add koftas. Reduce heat to low. Cook, turning occasionally, for 10 minutes or until cooked through. Transfer to a large baking tray. Cover with foil. Rest for 5 minutes. Serve."
        ],
        "ingredients": [
            "1kg coles lamb mince",
            "1 small brown onion, chopped",
            "2 garlic cloves, crushed",
            "1/2 tsp chilli flakes",
            "1 tbsp chopped fresh mint leaves",
            "1 tbsp chopped fresh flat-leaf parsley leaves",
            "2 tsp mild paprika",
            "1/2 tsp ground ginger",
            "2 tsp ground cumin",
            "1 tsp ground coriander"
        ],
        "coordinates": [
            100.81453752332341,
            18.08873494847337
        ],
        "thumbnailUrl": "https://img.taste.com.au/yFS1Fdvz/w720-h480-cfill-q80/taste/2011/03/lamb-kofta-cropped-hero-198300-1.jpg"
    },
    {
        "title": "Lebanese-style braised beans",
        "steps": [
            "Heat the oil in a large saucepan over medium heat. Cook the onion and garlic, stirring, for 5 mins or until softened. Add tomato and cook for 2 mins or until softened. Stir in tomato paste and ¾ cup water. Add the beans and chickpeas. Season and toss to combine.",
            "Bring to the boil over high heat. Reduce heat to low. Cook, covered, for 1 hr or until the beans are tender. Stir in the allspice and paprika. Increase heat to medium-high and simmer, uncovered, for 5 mins or until the sauce thickens slightly. Sprinkle with parsley. Serve with bread."
        ],
        "ingredients": [
            "1/4 cup extra virgin olive oil",
            "1 brown onion, sliced",
            "3 garlic cloves, thinly sliced",
            "2 roma tomatoes, finely chopped",
            "1 1/2 tbsp tomato paste",
            "600g green beans, trimmed",
            "400g can coles brand chickpeas, rinsed, drained",
            "1/2 tsp coles brand allspice",
            "1/2 tsp smoked paprika",
            "flat-leaf parsley leaves, torn, to serve",
            "coles bakery stone baked light rye sourdough vienna, to serve"
        ],
        "coordinates": [
            36.48310511132925,
            33.73901619394557
        ],
        "thumbnailUrl": "https://img.taste.com.au/w0s-zYm2/w720-h480-cfill-q80/taste/2016/11/lebanese-style-braised-beans-98109-1.jpeg"
    },
    {
        "title": "Sayur lodeh (Vegetable curry)",
        "steps": [
            "To make the spice paste, process the onion, garlic, chilli, coriander, cumin and turmeric in a food processor until a smooth paste forms.",
            "Heat oil in a wok or large saucepan over medium heat. Cook the spice paste, stirring, for 3 minutes or until aromatic. Add the coconut milk, stock, bay leaves and lemon grass. Reduce heat to low. Simmer for 15 minutes or until slightly reduced.",
            "Add the cauliflower, tofu and beans. Cook for 5 minutes or until the vegetables are tender crisp. Add the sugar and stir until combined."
        ],
        "ingredients": [
            "1 tbsp peanut oil",
            "400ml can coconut milk",
            "375ml (1 1/2 cups) massel chicken style liquid stock (see note)",
            "2 dried bay leaves",
            "1 lemon grass stem, tied in a knot",
            "1/2 (about 700g) cauliflower, cut into florets",
            "300g firm tofu, cut into 2cm pieces",
            "200g green round beans, trimmed, halved",
            "1 tbsp grated palm sugar or brown sugar",
            "1 brown onion, coarsely chopped",
            "2 garlic cloves, coarsely chopped",
            "1 long fresh red chilli, coarsely chopped",
            "1 tsp ground coriander",
            "1/2 tsp ground cumin",
            "1/4 tsp ground turmeric"
        ],
        "coordinates": [
            -8.864274775127775,
            5.332903307380465
        ],
        "thumbnailUrl": "https://img.taste.com.au/YBQ0dm5U/w720-h480-cfill-q80/taste/2016/11/sayur-lodeh-vegetable-curry-78788-1.jpeg"
    },
    {
        "title": "Lentil & lima bean salad",
        "steps": [
            "Place the lima beans in a large bowl and cover with plenty of cold water. Cover and set aside to soak overnight. (Alternatively, cover the beans with boiling water and set aside for 2 hours to soak.)",
            "Drain the lima beans and rinse under cold running water. Place the lentils in a sieve and rinse under cold running water until the water runs clear.",
            "Place the lima beans and lentils in separate large saucepans and cover each with 1.5 litres (6 cups) water. Cover and bring to the boil over medium heat. Simmer, uncovered, for 5 minutes. Drain the lentils and rinse under cold running water. Cook the lima beans for a further 40 minutes or until just tender. Drain and rinse under cold running water.",
            "Place the lentils, lima beans, shallots, tomatoes, avocado, basil and garlic in a large bowl. Toss gently to combine.",
            "Whisk the oil, lemon juice, mustard, salt and pepper in a small bowl. Pour over the salad and toss gently to combine. Taste and adjust the seasoning if necessary."
        ],
        "ingredients": [
            "200g (1 cup) dried lima beans",
            "310g (1 1/2 cups) dried split red lentils",
            "1 bunch green shallots, trimmed, sliced",
            "6 egg tomatoes, cut into 2cm pieces",
            "1 ripe avocado, halved, stone removed, peeled, cut into 2cm pieces",
            "1 cup firmly packed fresh basil leaves, shredded",
            "1 garlic clove, finely chopped",
            "60ml (1/4 cup) extra virgin olive oil",
            "1 tbsp fresh lemon juice",
            "1 tsp dijon mustard",
            "salt & ground black pepper, to taste"
        ],
        "coordinates": [
            19.938724820773373,
            29.089900496781304
        ],
        "thumbnailUrl": "https://www.taste.com.au/assets/static/images/generic-placeholder.jpg"
    },
    {
        "title": "Sri Lankan pork curry",
        "steps": [
            "Heat the oil in a wok over high heat. Add the half of the pork and cook for 2 minutes each side or until golden. Transfer to a plate. Repeat with the remaining pork.",
            "Add 3 of the curry sprigs and the cinnamon to the wok. Cook, stirring, for 30 seconds or until aromatic. Add the curry sauce and coconut cream. Reduce heat to low and simmer, stirring occasionally, for 10 minutes or until reduced slightly.",
            "Return the pork to the wok with the sugar and tamarind. Stir to combine. Simmer for 1 minute or until the sugar is dissolved and the pork is heated through. Stir through the remaining curry leaves.",
            "Serve pork curry on top of steamed rice, with chapati on the side."
        ],
        "ingredients": [
            "1 tbsp olive oil",
            "500g pork fillet, sliced into 3cm-thick pieces",
            "5 fresh curry leaf sprigs",
            "1 cinnamon stick",
            "125ml (1/2 cup) the world’s best curry sauce (see notes)",
            "270ml can coconut cream",
            "2 tsp brown sugar",
            "2 tsp tamarind puree",
            "steamed basmati rice, to serve",
            "heated chapati bread, to serve"
        ],
        "coordinates": [
            80.13290708247962,
            7.073921540702329
        ],
        "thumbnailUrl": "https://img.taste.com.au/t3yj3Bu9/w720-h480-cfill-q80/taste/2020/06/sri-lankan-pork-curry-163185-2.jpg"
    },
    {
        "title": "Cheat's chocolate lava cakes",
        "steps": [
            "Preheat oven to 200C/180C fan-forced. Line a baking tray with sides with baking paper. Brush a 12-hole, 1/3-cup-capacity muffin pan with 1 tablespoon melted butter. Dust base and sides of muffin pan holes with cocoa, shaking off excess.",
            "Place brownie mix in a bowl. Add eggs, 1/3 cup water and remaining melted butter. Whisk to combine. Divide mixture among prepared pan holes, filling about two-thirds full. Place 1 lindor ball into centre of each hole, pushing ball a third of the way into mixture.",
            "Bake for 15 minutes or until cake is firm to touch and chocolate balls have melted. Stand in pan for 1 to 2 minutes. Turn muffin tray onto prepared tray. Tap muffin pan to release cakes.",
            "Transfer cakes to serving plates (see notes). Dust with extra cocoa. Dollop with cream. Serve immediately."
        ],
        "ingredients": [
            "100g butter, melted",
            "1/4 cup cocoa powder",
            "380g packet chocolate brownie mix",
            "2 eggs",
            "12 x 70% cocoa lindor balls, unwrapped",
            "double cream, to serve",
            "cocoa powder, to serve"
        ],
        "coordinates": [
            21.246274525895466,
            55.7845730669286
        ],
        "thumbnailUrl": "https://img.taste.com.au/si4nXILd/w720-h480-cfill-q80/taste/2019/10/cheats-chocolate-lava-cakes-154556-2.jpg"
    },
    {
        "title": "Slow cooker Moroccan chicken",
        "steps": [
            "Heat oil in flameproof slow cooker bowl or a frying pan over medium-high heat. Add onion. Cook, stirring, for 3 minutes or until charred. Add garlic and cumin, coriander, cinnamon, paprika and turmeric. Cook, stirring, for 1 minute or until fragrant.",
            "Transfer bowl to slow cooker (or mixture from frying pan to slow cooker. Add stock, carrot, capsicum and zucchini. Place chicken on vegetables. Pour over tomatoes. Top with lemon and drizzle with honey. Season with salt and pepper. Cover. Cook on HIGH for 3 hours (or LOW for 6 hours). Add olives. Cook on HIGH for 30 minutes or until chicken is cooked through.",
            "Sprinkle with coriander sprigs. Serve with couscous and extra lemon wedges."
        ],
        "ingredients": [
            "1 tbsp extra virgin olive oil",
            "1 large red onion, cut into wedges",
            "2 garlic cloves, crushed",
            "2 tsp ground cumin",
            "2 tsp ground coriander",
            "2 tsp ground cinnamon",
            "2 tsp smoked paprika",
            "1/2 tsp ground turmeric",
            "1 salt-reduced chicken stock pot",
            "2 carrots, thickly sliced",
            "1 large red capsicum, thickly sliced",
            "1 large zucchini, halved lengthways, thickly sliced",
            "6 skinless chicken thigh cutlets",
            "400g can cherry tomatoes in juice",
            "1/2 lemon, thinly sliced",
            "2 tbsp coles honey",
            "1/2 cup pitted green olives",
            "1/2 cup fresh coriander sprigs",
            "cooked couscous, to serve",
            "lemon wedges, to serve"
        ],
        "coordinates": [
            -14.886646050551954,
            29.383281952098915
        ],
        "thumbnailUrl": "https://img.taste.com.au/m8hbauI3/w720-h480-cfill-q80/taste/2020/05/slow_cooker_moroccan_chicken-161246-1.jpg"
    },
    {
        "title": "Grilled madeira squares with butterscotch apples",
        "steps": [
            "Melt butter in a frying pan on medium. Add apple and cook, turning, for 5 mins, until golden. Reduce heat to low. Add sugar and stir to dissolve. Add cream and simmer for 2-3 mins, until thickened slightly.",
            "Meanwhile, cook madeira slices in a toaster until lightly golden. Serve topped with butterscotch apples and ice-cream."
        ],
        "ingredients": [
            "50g butter",
            "4 granny smith apples, peeled, cored, quartered",
            "1/3 cup brown sugar",
            "1/2 cup thickened cream",
            "450g madeira cake, cut into 8 slices",
            "coles brand finest madagascan vanilla bean ice cream, to serve"
        ],
        "coordinates": [
            48.479716672598585,
            -25.173069951096366
        ],
        "thumbnailUrl": "https://img.taste.com.au/UNIGKBCk/w720-h480-cfill-q80/taste/2016/11/grilled-madeira-squares-with-butterscotch-apples-97483-1.jpeg"
    },
    {
        "title": "Mexican chicken pasta bake",
        "steps": [
            "Preheat oven to 200C/180C fan forced. Grease an 18 x 22cm (base measurement) baking dish. Cook the pasta in a large saucepan of salted boiling water until just al dente. Drain.",
            "Wipe saucepan dry. Heat the oil over medium heat. Add the onion, capsicum and garlic. Cook, stirring occasionally, for 5 minutes or until softened. Add the seasoning and cook, stirring, for 2 minutes or until aromatic. Add the chicken, tomato, beans and water. Bring to the boil. Reduce heat to low. Simmer, covered, for 5 minutes. Uncover and simmer for a further 5 minutes or until thickened. Add pasta and stir until well combined. Remove from heat.",
            "Combine the cheese blend and feta in a small bowl. Add 3/4 cup cheese mixture to the pasta mixture. Stir to combine. Spoon into the prepared dish. Sprinkle with remaining cheese and bake for 25-30 minutes or until melted and golden. Set aside for 10 minutes to cool slightly. Top with sour cream and jalapeños, if using, to serve."
        ],
        "ingredients": [
            "250g coles durum wheat macaroni pasta",
            "1 tbsp extra virgin olive oil",
            "1 small red onion, finely chopped",
            "1 small red capsicum, deseeded, finely chopped",
            "2 garlic cloves, crushed",
            "120g sachet mexican spice seasoning",
            "1/2 barbecued chicken, skin and bones removed, meat shredded",
            "400g can crushed tomatoes",
            "420g can black beans, rinsed, drained",
            "1/2 cup water",
            "170g (1 1/2 cups) mexican cheese blend",
            "80g coles dairy cheese fetta australian style, crumbled",
            "coles sour cream, to serve",
            "thinly sliced jalapeños, to serve (optional)"
        ],
        "coordinates": [
            -98.30915851518728,
            23.403439928382845
        ],
        "thumbnailUrl": "https://img.taste.com.au/vMZfMWaB/w720-h480-cfill-q80/taste/2021/05/mexican-chicken-pasta-bake-171430-2.jpg"
    },
    {
        "title": "Tulumbi (Macedonian pastries in syrup)",
        "steps": [
            "Place sugar, juice, 2 tsp vanilla and 500ml (2 cups) water in a large saucepan over medium-high heat. Cook, stirring, until comes to boil. Simmer, without stirring, for 5 minutes. Set aside to cool completely.",
            "Meanwhile, place the milk, butter, extra sugar and 250ml (1 cup) water in a saucepan over high heat. Bring to the boil then remove from heat. Add the flour and remaining vanilla. Use a wooden spoon to stir until well combined. Return pan to low heat and cook, stirring, for 1-2 minutes or until the dough comes together. Remove from heat. Use electric beaters to beat the dough in a bowl for 3-4 minutes or until cooled slightly. Gradually add the egg, beating well after each addition, until well combined. Spoon the dough into a piping bag fitted with a 1.5cm fluted nozzle.",
            "Pour oil into a large deep frying pan to a depth of 5cm. Place over medium heat and heat to 130°C on a cook’s thermometer. Pipe a few 6cm lengths of dough into the oil, cutting the dough at the base of the nozzle with a pair of lightly oiled kitchen scissors (do not crowd pan). Cook, turning occasionally, for 5-10 minutes or until golden. Use a slotted spoon to transfer to a plate lined with paper towel to drain. Repeat, in batches, with the remaining dough, reheating the oil between batches if necessary.",
            "Transfer the tulumbi to cooled syrup. Set aside for 30 seconds to soak (see tip). Use a slotted spoon to transfer to a serving plate."
        ],
        "ingredients": [
            "660g (3 cups) caster sugar, plus 1 tbsp, extra",
            "2 tbsp fresh lemon juice",
            "3 tsp vanilla extract",
            "125ml (1/2 cup) milk",
            "60g unsalted butter, chopped",
            "225g (1 1/2 cups) plain flour",
            "4 eggs, lightly whisked",
            "vegetable oil, to deep fry"
        ],
        "coordinates": [
            21.983997371459505,
            42.16051746613374
        ],
        "thumbnailUrl": "https://img.taste.com.au/8_HROO8s/w720-h480-cfill-q80/taste/2022/07/tulumbi-macedonian-pastries-in-syrup-recipe-180060-2.jpg"
    },
    {
        "title": "Choc-hazelnut cake with malted cream cheese icing",
        "steps": [
            "Preheat oven to 180°C. Grease a 20cm (base measurement) round cake pan and line the base and side with baking paper.",
            "Combine chopped chocolate, butter and milk in a medium saucepan over low heat. Cook, stirring, for 4-5 mins or until chocolate melts and mixture is smooth. Set aside for 15 mins to cool.",
            "Transfer chocolate mixture to a large bowl. Add the brown sugar, flour, hazelnut meal, egg and half the malted milk powder. Use an electric mixer on medium to beat the mixture, scraping down sides of the bowl occasionally, for 3 mins or until mixture changes colour. Pour mixture into prepared pan. Smooth the surface. Bake for 1 hour or until a skewer inserted in the centre comes out clean. Set aside in the pan for 15 mins before turning onto a wire rack to cool completely.",
            "Use an electric mixer to beat cream cheese, extra butter, icing sugar and remaining malted milk powder in a bowl until smooth.",
            "Use a large serrated knife to cut cake into three layers. Place 1 cake layer on a serving plate. Spread with one-third of the cream cheese mixture. Continue layering with remaining cake layers and cream cheese mixture. Top with Maltesers and sprinkle with grated chocolate to serve."
        ],
        "ingredients": [
            "150g dark chocolate, chopped",
            "150g butter, chopped",
            "3/4 cup (180ml) milk",
            "1 cup (220g) brown sugar",
            "1 cup (150g) self-raising flour",
            "3/4 cup (75g) hazelnut meal",
            "3 coles australian free range eggs, lightly whisked",
            "2/3 cup (70g) coles malted milk powder",
            "250g cream cheese, softened",
            "225g butter, extra, softened",
            "2 cups (320g) icing sugar",
            "100g maltesers",
            "50g dark chocolate, extra, finely grated"
        ],
        "coordinates": [
            -7.336728616061452,
            23.518025346337826
        ],
        "thumbnailUrl": "https://img.taste.com.au/pj2SNg0c/w720-h480-cfill-q80/taste/2018/07/choc-hazelnut-cake-with-malted-cream-cheese-filling-138992-1.jpg"
    },
    {
        "title": "Gingerbread ice-cream pudding",
        "steps": [
            "Line an 8-cup-capacity metal pudding basin with plastic wrap.",
            "Place ice-cream in a large bowl. Stand 10 minutes to soften slightly. Press into prepared basin. Freeze for 6 hours or until firm.",
            "Meanwhile, line a large baking tray with baking paper. Microwave chocolate melts on HIGH (100%) for 1 minute or until smooth, stirring every 30 seconds with a metal spoon. Pour chocolate onto prepared tray. Spread to form a 35cm x 25cm rectangle. Decorate with m&m’s and gingerbread men. Stand for 30 minutes or until chocolate has set. Cut bark into shards.",
            "Turn pudding onto a serving plate. Carefully remove plastic wrap. Drizzle with Ice Magic. Top with bark. Decorate with Maltesers. Serve immediately."
        ],
        "ingredients": [
            "2.5 litres coles gingerbread ice-cream",
            "290g packet dark chocolate melts",
            "2 tbsp red and green mini m&m's",
            "50g mini gingerbread men",
            "1/2 cup chocolate ice magic",
            "maltesers, halved, to serve"
        ],
        "coordinates": [
            14.520304615867826,
            35.904704268766075
        ],
        "thumbnailUrl": "https://img.taste.com.au/3rGGp6T0/w720-h480-cfill-q80/taste/2017/11/gingerbread-ice-cream-pudding_1980x1320-132665-1.jpg"
    },
    {
        "title": "Burmese pork and peanut curry",
        "steps": [
            "Combine coconut milk, curry paste, fish sauce, sugar and lemongrass in a large saucepan. Bring to the boil over medium/high heat. Cook, uncovered, for 10 to 15 minutes or until sauce thickens slightly.",
            "Stir pork, chillies, lime leaves and peanuts into curry mixture. Bring to the boil. Reduce heat to low and simmer, uncovered, stirring often, for 1 hour 20 minutes or until pork is tender.",
            "Remove lemongrass. Serve curry with rice. Tip Use a food processor to grind roasted peanuts to a fine powder."
        ],
        "ingredients": [
            "2 x 400ml cans coconut milk",
            "1/4 cup red curry paste",
            "1/3 cup fish sauce",
            "1/4 cup grated palm sugar or brown sugar",
            "2 lemongrass stalks, trimmed, cut into thirds, bruised",
            "1kg shoulder pork, trimmed, cut into thin strips",
            "2 small red chillies, deseeded, finely chopped",
            "5 makrut lime leaves, spine removed, shredded",
            "1 cup roasted salted peanuts, ground steamed jasmine rice, to serve"
        ],
        "coordinates": [
            100.11941391765995,
            24.200938336727816
        ],
        "thumbnailUrl": "https://img.taste.com.au/3NF1QZiq/w720-h480-cfill-q80/taste/2016/11/burmese-pork-and-peanut-curry-2275-1.jpeg"
    },
    {
        "title": "One-pan Mongolian beef crispy fried rice",
        "steps": [
            "Heat 2 tsp of oil in a large deep frying pan or wok on medium-high heat. Add beef mince and cook, breaking up the mince with a wooden spoon, for 5 minutes or until starting to brown and crisp.",
            "Meanwhile, to make Mongolian sauce, combine hoisin sauce, soy sauce, garlic and Chinese five spice in a small jug.",
            "Add onion, garlic and snow peas to the beef mixture, and cook, stirring occasionally, for 2 minutes or until the snow peas are tender-crisp. Transfer the mixture to a medium heatproof bowl.",
            "Meanwhile, combine rice and remaining oil in a medium bowl.",
            "Heat the same frying pan over medium heat. Add the rice mixture and spread it over the base and up the side of the pan in an even layer. Cook, without stirring, for 5 minutes or until the base of the rice is golden brown (the rice will stick together to form one piece). Flip the rice mixture and stir, breaking up the rice, before spreading out again in a single layer. Cook, without stirring, for 3-4 minutes or until the base of the rice is golden. Stir the rice mixture once more, breaking it up. Return the beef mixture to the pan with 80ml (1/3 cup) Mongolian sauce and cook, stirring, until the mixture is heated through.",
            "Serve your beef fried rice sprinkled with shallot and drizzled with the remaining Mongolian sauce. Watch our step-by-step video below to see how to make our one-pan Mongolian beef crispy fried rice."
        ],
        "ingredients": [
            "2 tbsp coles asia pure roasted sesame oil",
            "500g pkt coles no added hormone beef 3 star regular mince",
            "1 large brown onion, cut into thick wedges",
            "1 garlic clove, crushed",
            "150g snow peas, trimmed, halved diagonally",
            "450g pkt microwave long grain white rice",
            "1 green shallot, thinly sliced diagonally",
            "80ml (1/3 cup) coles asia cantonese style hoisin sauce",
            "2 tbsp coles asia premium light soy sauce",
            "1 garlic clove, crushed",
            "1 tsp chinese five spice powder"
        ],
        "coordinates": [
            90.80175022309562,
            48.19760430974988
        ],
        "thumbnailUrl": "https://img.taste.com.au/K9KBjXQ_/w720-h480-cfill-q80/taste/2025/05/one-pan-mongolian-beef-crispy-fried-rice-211600-1.jpg"
    },
    {
        "title": "Chicken laksa",
        "steps": [
            "Heat a large saucepan over medium-high heat. Add the laksa paste, ginger and turmeric and cook, stirring, for 1 min or until aromatic. Add the stock and bring to a simmer, then add the chicken and reduce heat to medium-low. Cook, turning occasionally, for 10 mins or until the chicken is cooked through. Use tongs to transfer the chicken to a heatproof bowl. Set aside for 5 mins to cool slightly.",
            "Meanwhile, add the pumpkin to the laksa mixture. Cook for 10 mins or until pumpkin is tender. Place the noodles in a large heatproof bowl. Cover with boiling water. Set aside for 5 mins to soak. Drain and divide among serving bowls. Use 2 forks to coarsely shred the chicken.",
            "Add the coconut milk, lime juice, fish sauce and sugar to the laksa mixture. Cook for 5 mins or until heated through. Ladle the soup over the noodles. Top with shredded chicken, spring onion, chilli, coriander and mint."
        ],
        "ingredients": [
            "220g jar laksa paste",
            "1 tbsp ginger, finely grated",
            "1 tsp ground turmeric",
            "4 cups (1l) chicken stock",
            "2 coles australian rspca approved chicken breast fillets",
            "500g pkt coles diced butternut pumpkin",
            "250g rice stick noodles",
            "400g can coconut milk",
            "1 tbsp lime juice",
            "1 tbsp fish sauce",
            "2 tsp brown sugar",
            "2 spring onions, thinly sliced diagonally",
            "1 long red chilli, thinly sliced",
            "1 cup coriander leaves",
            "1/2 cup mint leaves"
        ],
        "coordinates": [
            102.57996509835212,
            5.165682150273386
        ],
        "thumbnailUrl": "https://img.taste.com.au/szCQpu6e/w720-h480-cfill-q80/taste/2014/05/chicken-laksa-3000x2000-127186-1.jpg"
    },
    {
        "title": "Date night cheese platter",
        "steps": [
            "Arrange ingredients on a cheese board or serving platter."
        ],
        "ingredients": [
            "115g australian gold brie cheese or 125g coles brie",
            "150g coles british blue stilton",
            "2 slices coles raisin toast, toasted, halved diagonally",
            "4 fresh dates, halved, pitted",
            "65g coles dried turkish apricots",
            "80g fruit and nut chocolate",
            "50g coles chocolate strawberries",
            "40g walnuts",
            "1 corella pear, cored, thinly sliced",
            "1 pink lady apple, cored, thinly sliced",
            "80g strawberries, halved",
            "25g blackberries",
            "honey, to serve",
            "cracked pepper water crackers, to serve"
        ],
        "coordinates": [
            9.516823932938696,
            19.21996608850841
        ],
        "thumbnailUrl": "https://img.taste.com.au/CtWSqEcL/w720-h480-cfill-q80/taste/2020/09/october20_date-night-cheese-board-taste-165109-1.jpg"
    },
    {
        "title": "West African chicken stew",
        "steps": [
            "Heat oil in a large heavy-based saucepan over medium heat. Cook chicken pieces, in batches, for 2 minutes each side or until golden. Transfer to a large plate.",
            "Add onion to pan. Cook, stirring occasionally, for 5 minutes or until softened. Add garlic, ginger, cumin, ground coriander and cayenne pepper. Cook for 30 seconds or until fragrant. Add peanut butter and stock. Stir until smooth and combined. Stir in tomatoes and 1/2 cup water.",
            "Return chicken to pan. Bring to the boil. Reduce heat to low. Cover. Simmer, stirring occasionally, for 30 minutes or until chicken is almost cooked through. Cook, uncovered, for a further 15 minutes or until sauce has thickened slightly and chicken is cooked. Stir in lemon juice. Season with salt and pepper.",
            "Meanwhile, make cauliflower rice: Place cauliflower in a food processor. Process until finely chopped. Heat oil in a large, deep frying pan over medium heat. Add cauliflower. Cook, stirring occasionally, for 20 minutes or until light golden and tender. Stir in green onion. Season with salt.",
            "Serve chicken stew with cauliflower rice and sprinkle with nuts and coriander leaves."
        ],
        "ingredients": [
            "2 tbsp vegetable oil",
            "1.8kg whole chicken, cut into 8 pieces",
            "1 large brown onion, chopped",
            "2 garlic cloves, crushed",
            "2cm piece fresh ginger, peeled, finely grated",
            "1 tsp ground cumin",
            "2 tsp ground coriander",
            "1/2 tsp cayenne pepper",
            "3/4 cup crunchy peanut butter",
            "1 cup chicken stock",
            "400g can diced tomatoes",
            "1 tbsp lemon juice",
            "chopped peanuts, to serve",
            "fresh coriander leaves, to serve",
            "1 head (1.2kg) cauliflower, cut into florets",
            "2 tbsp vegetable oil",
            "4 green onions, thinly sliced"
        ],
        "coordinates": [
            7.003838305015101,
            12.159501441536563
        ],
        "thumbnailUrl": "https://img.taste.com.au/ODrtOxp5/w720-h480-cfill-q80/taste/2016/11/west-african-chicken-stew-102761-1.jpeg"
    },
    {
        "title": "Basic pancakes",
        "steps": [
            "Whisk milk, egg and vanilla together in a jug. Sift flour and bicarbonate into a bowl. Stir in sugar. Make a well in centre. Add milk mixture. Whisk until just combined.",
            "Heat a large non-stick frying pan over medium heat. Brush pan with melted butter. Using 1/4 cup mixture per pancake, cook 2 pancakes for 3 to 4 minutes or until bubbles appear on surface. Turn and cook for 3 minutes or until cooked through. Transfer to a plate. Cover loosely with foil to keep warm. Repeat with remaining mixture, brushing pan with butter between batches. Serve."
        ],
        "ingredients": [
            "1 1/2 cups milk",
            "1 egg",
            "2 tsp vanilla extract",
            "2 cups self-raising flour",
            "1/4 tsp coles bicarbonate soda",
            "1/3 cup caster sugar",
            "25g butter, melted",
            "butter, to serve"
        ],
        "coordinates": [
            3.541545501544009,
            53.3113676167851
        ],
        "thumbnailUrl": "https://img.taste.com.au/a68Guxgi/w720-h480-cfill-q80/taste/2010/08/basic-pancakes-image1-199382-1.jpg"
    },
    {
        "title": "Air fryer garlic bread tuna melts",
        "steps": [
            "Place tuna, burger sauce, pickles, pickling liquid, lemon juice and shallot in a bowl. Stir to combine.",
            "Place half the garlic bread slices on a board, buttered-side down. Top with extra burger sauce, tuna mixture, mozzarella and remaining garlic bread slices, buttered-side up.",
            "Place, in batches, in the basket of an air fryer. Cook at 200C for 7-8 minutes or until golden. Serve.\n\nWatch our step-by-step video below to see how to make these Air fryer garlic bread tuna melts."
        ],
        "ingredients": [
            "425g can coles simply tuna in vegetable oil, drained",
            "60g (1/4 cup) coles flame grilled burger sauce, plus 2 tbsp extra",
            "2 dill pickles, finely chopped, plus 1 tbsp pickling liquid",
            "1/2 lemon, juiced",
            "2 green shallots, thinly sliced",
            "2 x 270g packets coles simply garlic bread slices",
            "100g (1 cup) pre-grated mozzarella"
        ],
        "coordinates": [
            11.212536415020146,
            71.56152161925947
        ],
        "thumbnailUrl": "https://img.taste.com.au/xcY3h_7I/w720-h480-cfill-q80/taste/2023/12/air-fryer-garlic-bread-tuna-melts-194427-1.jpg"
    },
    {
        "title": "Choc-orange crepe cake",
        "steps": [
            "To make the crepes, sift the flour, sugar and cocoa powder into a bowl. Make a well in the centre. Whisk the eggs and milk in a jug, and gradually add to the flour mixture, stirring gently with a whisk to combine (don’t beat).",
            "Spray a 20cm (base measurement) non-stick frying pan with oil. Heat over medium-high heat. Fill a 1/4 cup measure about two-thirds full with batter. Pour into the centre of the pan, and tilt to evenly cover the base. Cook for about 1 min, until lightly coloured underneath, then turn and cook a further 30 secs. Turn out onto a wire rack to cool.",
            "Repeat, spraying and reheating the pan between crepes, and reducing heat slightly if they’re browning too quickly, to make 20 crepes, stacking them neatly on top of each other as they cool.",
            "To make the syrup, strain orange juice into a medium saucepan. Add the sugar and stir over low heat until the sugar dissolves. Increase heat to medium and bring to the boil. Cook for 7 mins or until syrupy. Remove from heat. Add orange slices and cool to room temperature.",
            "To make the filling, use an electric mixer to beat the ricotta, cream, sugar and orange zest in a bowl until combined. Use the back of a spoon to spread a heaped tablespoons of filling in a thin layer over 1 crepe. Repeat with another crepe, and place it neatly on top. Continue layering with the remaining ricotta mixture and crepes. Cut into wedges and serve with the oranges slices and syrup."
        ],
        "ingredients": [
            "1 cup plain flour",
            "1/3 cup caster sugar",
            "2 tbsp cocoa powder",
            "4 eggs",
            "2 cups milk",
            "spray olive oil",
            "1 cup freshly squeezed orange juice",
            "3/4 cup caster sugar",
            "2 navel oranges, peeled, cut crossways into 7mm-thick slices, seeds removed",
            "500g coles deli full-cream ricotta",
            "1/2 cup coles brand thickened cream",
            "2 tbsp coles brand icing sugar, sifted",
            "finely grated zest of 1 orange"
        ],
        "coordinates": [
            87.57836522852666,
            29.59152868625121
        ],
        "thumbnailUrl": "https://img.taste.com.au/Cf_i6gQ3/w720-h480-cfill-q80/taste/2016/11/choc-orange-crepe-cake-90198-1.jpeg"
    },
    {
        "title": "Homemade honeycomb",
        "steps": [
            "Grease and line an oven tray with baking paper.",
            "Combine sugar, honey, water and golden syrup in a medium saucepan. Place over low heat and cook, stirring, occasionally brushing down side of the pan and spoon with a pastry brush dipped in water to remove any sugar crystals, for 5-7 minutes or until sugar dissolves. Increase heat to high and bring to the boil. Cook, without stirring, for 5-7 minutes or until the syrup reaches crack stage (154°C) on a sugar thermometer. Remove from heat and set aside for bubbles to subside.",
            "Add the bicarbonate of soda and quickly stir with a wooden spoon until combined (mixture will bubble and foam). Pour onto the tray and set aside to cool completely.",
            "Place the chocolate in a heatproof bowl over a saucepan of simmering water. Stir occasionally with a metal spoon until chocolate melts and is smooth. Transfer to a small plastic bag. Use scissors to snip off a corner of the bag.",
            "Turn the honeycomb onto a clean surface. Break into large pieces. Drizzle chocolate over honeycomb pieces and put aside to set. Store in an airtight container."
        ],
        "ingredients": [
            "1 1/2 cups (335g) white sugar",
            "1/2 cup (125ml) honey",
            "1/3 cup (80ml) water",
            "2 tbsp golden syrup",
            "2 tsp coles bicarbonate soda",
            "200g cadbury baking dark chocolate, chopped"
        ],
        "coordinates": [
            173.6180032198915,
            -38.47832115926206
        ],
        "thumbnailUrl": "https://img.taste.com.au/dYarJQWK/w720-h480-cfill-q80/taste/2011/01/homemade-honeycomb-cropped-201080-1.jpg"
    },
    {
        "title": "Oven-roasted Moroccan salmon",
        "steps": [
            "Whisk oil, seasoning and lemon juice in a jug until well combined. Place salmon in a single layer in a ceramic shallow dish. Drizzle over marinade and turn to coat salmon on both sides. Cover and refrigerate for 30 minutes.",
            "Preheat oven to 200C (180C fan-forced). Line the base of a large heavy-based roasting pan with baking paper. Place salmon skin-side down in pan, scatter in lemon wedges. Spray salmon and lemons with rice bran oil.",
            "Roast for 12-14 minutes (depending on thickness) until salmon is just cooked through. Squeeze juice from the hot lemon wedges over salmon. Sprinkle with parsley and serve with hommus."
        ],
        "ingredients": [
            "2 tbsp olive oil",
            "1 tbsp coles mild moroccan seasoning",
            "2 tbsp lemon juice",
            "6 x 150g fresh atlantic salmon portions (skin on), deboned",
            "1 lemon, quartered length-ways",
            "rice bran oil spray",
            "2 tbsp flat-leaf parsley, chopped",
            "250g hommus, to serve"
        ],
        "coordinates": [
            54.30071533785195,
            24.329760979499255
        ],
        "thumbnailUrl": "https://img.taste.com.au/g5OrQhtP/w720-h480-cfill-q80/taste/2016/11/oven-roasted-moroccan-salmon-108168-1.jpeg"
    },
    {
        "title": "Lamb kofta",
        "steps": [
            "Place mince, onion, garlic, chilli flakes, mint, parsley, paprika, ginger, cumin and coriander in a bowl. Mix to combine.",
            "Shape 1/4 cup lamb mixture at a time into sixteen 8cm-long sausages. Thread 1 sausage onto each skewer. Place on a large baking tray. Cover. Refrigerate for 20 minutes or until firm.",
            "Heat an oiled barbecued plate on high. Add koftas. Reduce heat to low. Cook, turning occasionally, for 10 minutes or until cooked through. Transfer to a large baking tray. Cover with foil. Rest for 5 minutes. Serve."
        ],
        "ingredients": [
            "1kg coles lamb mince",
            "1 small brown onion, chopped",
            "2 garlic cloves, crushed",
            "1/2 tsp chilli flakes",
            "1 tbsp chopped fresh mint leaves",
            "1 tbsp chopped fresh flat-leaf parsley leaves",
            "2 tsp mild paprika",
            "1/2 tsp ground ginger",
            "2 tsp ground cumin",
            "1 tsp ground coriander"
        ],
        "coordinates": [
            65.93694171760752,
            33.96289865614714
        ],
        "thumbnailUrl": "https://img.taste.com.au/yFS1Fdvz/w720-h480-cfill-q80/taste/2011/03/lamb-kofta-cropped-hero-198300-1.jpg"
    },
    {
        "title": "Chargrilled pork with papaya mojo",
        "steps": [
            "Combine the papaya, beans, avocado, shallot, coriander, chilli, juice and 1 tablespoon of the oil in a bowl. Season with salt and pepper.",
            "Heat a large barbecue plate or char-grill over medium heat. Brush the pork with the remaining oil and season with salt and pepper. Cook for 3 minutes each side for medium or until cooked to your liking. Set aside, covered, for 3 minutes to rest.",
            "Meanwhile, heat the tortillas on the barbecue plate or char-grill.",
            "Divide the pork among serving plates and top with the papaya mixture. Serve with the tortillas."
        ],
        "ingredients": [
            "1 red papaya, flesh diced",
            "400g can red kidney beans, drained, rinsed",
            "1 avocado, flesh diced",
            "2 shallots, thinly sliced",
            "1/3 cup chopped fresh coriander",
            "1 small fresh red chilli, finely chopped (deseeded if desired)",
            "1 tbsp fresh lime juice",
            "1 1/2 tbsp olive oil",
            "4 coles pork sirloin steaks",
            "4 flour tortillas"
        ],
        "coordinates": [
            -81.27450066881322,
            8.164493564807646
        ],
        "thumbnailUrl": "https://img.taste.com.au/H-CcpLAM/w720-h480-cfill-q80/taste/2016/11/chargrilled-pork-with-papaya-mojo-98992-1.jpeg"
    },
    {
        "title": "Healthy harissa chicken, lentil and kale tray bake",
        "steps": [
            "Preheat oven to 200C/180C fan forced. Line a large baking dish or tray with baking paper. Place the carrot, onion and rosemary in prepared dish and drizzle with the oil. Bake for 15-20 minutes or until light golden and tender.",
            "Meanwhile, combine the harissa, 1 tbs lemon juice and garlic in a shallow dish. Add the chicken and turn to coat. Set aside for 10 minutes to marinate.",
            "Place the lentils, kale and stock in the dish with the carrot mixture and stir to combine. Top with the chicken. Bake for a further 10-15 minutes or until chicken is cooked through. Top with labneh and a little lemon zest. Season and serve."
        ],
        "ingredients": [
            "3 small carrots, peeled, diagonally sliced",
            "2 large red onions, cut into thin wedges",
            "1 tbsp chopped fresh rosemary leaves",
            "1 tbsp extra virgin olive oil",
            "2 tsp harissa paste",
            "1 lemon, rind zested, juiced",
            "1 garlic clove, crushed",
            "8 (about 500g) chicken tenderloins, trimmed",
            "400g can no-added-salt brown lentils, rinsed, drained",
            "80g coles chopped kale",
            "160ml (2/3 cup) chicken stock",
            "90g (1/3 cup) labneh, drained"
        ],
        "coordinates": [
            -70.18703692125139,
            -11.457614615404982
        ],
        "thumbnailUrl": "https://img.taste.com.au/FkKZsXud/w720-h480-cfill-q80/taste/2019/06/harissa-chicken-lentil-kale-tray-bake-p70-151285-2.jpg"
    },
    {
        "title": "Filipino chicken adobo",
        "steps": [
            "Use a sharp knife to cut the chicken marylands through the joint to separate the drumsticks and thighs.",
            "Whisk the vinegar, soy sauce, sugar, pepper, bay leaves, ginger and half of the garlic in a glass or ceramic bowl. Add the chicken and stir to coat. Cover with plastic wrap and place in the fridge for 30 minutes to marinate.",
            "Heat the oil in a large heavy-based saucepan over high heat. Remove chicken from the marinade. Reserve marinade. Cook chicken, in 2 batches, for 3-4 minutes each side or until golden brown. Transfer chicken to a plate and set aside.",
            "Remove and discard all but 2 tbs of the fat from the saucepan. Heat fat in pan over medium-high heat. Add the onion, chilli and remaining garlic and cook, stirring occasionally, for 5 minutes or until onion is golden brown. Return chicken to pan with reserved marinade and water. Cover and reduce heat to low. Simmer for 30 minutes or until chicken is cooked through.",
            "Transfer the chicken pieces to a large serving bowl or platter. Place the sauce over medium-high heat and simmer for 10 minutes or until thickened slightly. Pour sauce over the chicken and sprinkle with the shallot."
        ],
        "ingredients": [
            "6 (about 2kg) chicken marylands",
            "185ml (3/4 cup) apple cider vinegar",
            "80ml (1/3 cup) light soy sauce",
            "55g (1/4 cup) brown sugar, firmly packed",
            "1/4 tsp freshly ground black pepper",
            "4 fresh bay leaves",
            "1 tbsp fresh ginger, finely grated",
            "6 garlic cloves, finely chopped",
            "1 tbsp vegetable oil",
            "1 brown onion, halved, sliced",
            "2 long fresh red chillies, thinly sliced",
            "60ml (1/4 cup) water",
            "1/4 cup green shallots, sliced"
        ],
        "coordinates": [
            125.70162194674533,
            9.636506870908594
        ],
        "thumbnailUrl": "https://img.taste.com.au/ClM64dvl/w720-h480-cfill-q80/taste/2016/11/filipino-chicken-adobo-102342-1.jpeg"
    },
    {
        "title": "Parmesan and Dijon-crusted chicken",
        "steps": [
            "Place bread slices in a food processor and pulse into small crumbs. Transfer to a large tray or baking dish and mix in parmesan cheese and parsley. Season well with salt and pepper.",
            "Using a pastry brush, coat the chicken breast with the mustard. Press the chicken into the breadcrumb mixture, coating well on all sides.",
            "Place a medium pan of salted water over high heat and bring to the boil. Add beans and cook until tender but still crisp, about 2 minutes. Drain and set aside.",
            "Heat the olive oil in large frying pan over medium-high heat until hot. Cook the chicken for 3 minutes on each side or until medium golden brown and cooked through, adding more oil as needed. Remove and place on a plate lined with paper towels and lightly covered with foil. Drain all except 1 tablespoon of oil from the pan and return to the heat.",
            "Reduce the heat to medium and cook the onion for about 2 minutes, until it starts to soften. Add the beans and cook a further 2-4 minutes until tender. Add capers and lemon juice and toss to combine. Season.",
            "To serve, slice chicken and divide between 4 serving plates. Top with green beans and capers."
        ],
        "ingredients": [
            "3 slices coles smart buy white bread",
            "1/4 cup fresh parsley, roughly chopped",
            "2 tbsp coles brand shredded parmesan cheese",
            "2 medium chicken breasts (600g), pounded to 1cm thickness",
            "1 tbsp coles brand dijon mustard",
            "3 tbsp olive oil",
            "1/2 small red onion, thickly sliced",
            "1 tbsp coles brand baby capers, drained",
            "250g green beans, ends trimmed, cut into 3cm pieces",
            "1/2 lemon, juice"
        ],
        "coordinates": [
            14.647737293712634,
            51.475617684461895
        ],
        "thumbnailUrl": "https://img.taste.com.au/EdUAl03D/w720-h480-cfill-q80/taste/2016/11/parmesan-and-dijon-crusted-chicken-89830-1.jpeg"
    },
    {
        "title": "Pesto salmon with rice salad",
        "steps": [
            "Preheat grill on medium. Line a baking tray with foil. Lightly spray foil with olive oil spray. Place the salmon, skin-side down, on the prepared tray. Spread each piece of salmon with 1 tbs of pesto. Cook under the grill for 5 mins or until salmon is just cooked through.",
            "Meanwhile, heat rice following packet directions. Transfer to a large heatproof bowl. Add carrot, snow peas and half the remaining pesto. Toss to combine.",
            "Divide the rice mixture evenly among serving plates. Top with the salmon and drizzle with remaining pesto to serve."
        ],
        "ingredients": [
            "4 coles australian skin-on salmon portions",
            "2/3 cup (180g) basil pesto",
            "2 x 250g pkts coles 7 ancient grain microwavable rice",
            "2 carrots, peeled, cut into long matchsticks",
            "200g snow peas, trimmed, thinly sliced lengthways"
        ],
        "coordinates": [
            -65.62389589812896,
            18.046522614663445
        ],
        "thumbnailUrl": "https://img.taste.com.au/6mARg7Z6/w720-h480-cfill-q80/taste/2020/02/mar20_pesto-salmon-with-rice-salad-158584-1.jpg"
    },
    {
        "title": "Portuguese Custard Tarts",
        "steps": [
            "In a large saucepan, whisk together the egg and egg yolks, sugar and cornflour until smooth. Add a little of the milk until a paste is formed. Then add remainder of milk, cream and vanilla whisking until smooth.",
            "Bring mixture to the boil whilst stirring until thickened. Transfer to a bowl, cover with plastic wrap to prevent a skin forming. Refrigerate until chilled.",
            "Pre-heat oven to 210°C (190°C fan-forced). Lightly oil 12, ⅓ cup capacity muffin pans.",
            "Place pastry on benchtop and cut in half forming two rectangles. Place one on top of the other. From the short end, roll up firmly to form a roll of pastry. Cut into 12 equal sized pieces.",
            "Roll pieces of pastry to approx. 8cm diameter and press into muffin pans. Spoon chilled custard between pastry shells and bake for 20-22 minutes until custard is starting to turn golden. Allow to sit for several minutes before removing from pans. Enjoyed best whilst warm."
        ],
        "ingredients": [
            "2 extra large egg yolks",
            "1 extra large egg",
            "½ cup caster sugar",
            "2 tbsp coles cornflour",
            "200ml milk",
            "200ml pure cream",
            "½ tsp vanilla extract",
            "1 sheet butter puff pastry, defrosted"
        ],
        "coordinates": [
            -8.439476943276066,
            40.27273847840677
        ],
        "thumbnailUrl": "https://img.taste.com.au/gvyiXFrf/w720-h480-cfill-q80/taste/2018/01/portuguesetart-134435-1.jpg"
    },
    {
        "title": "Coconut-crumbed prawns with lime aioli",
        "steps": [
            "Using the palm of your hand, slightly flatten prawns. Place flour in a bowl. Add prawns. Toss to coat.",
            "Whisk egg and 2 tablespoons cold water together in a shallow bowl. Combine coconut and breadcrumbs on a plate. Dip 1 prawn in egg mixture, then breadcrumb mixture. Place on a plate. Repeat with remaining prawns, egg mixture and breadcrumb mixture.",
            "Heat oil in a large frying pan. Cook prawns for 2 minutes each side or until golden and cooked through.",
            "Meanwhile, make aioli Place mayonnaise, garlic, lime rind and lime juice in a bowl. Stir to combine.",
            "Serve prawns with aioli."
        ],
        "ingredients": [
            "8 large green king prawns, peeled, deveined, tails intact",
            "1/4 cup plain flour",
            "1 egg",
            "1/2 cup coles shredded coconut",
            "1/2 cup panko breadcrumbs (see note)",
            "vegetable oil, for shallow-frying",
            "1/4 cup whole-egg mayonnaise",
            "1 small garlic clove, crushed",
            "1/2 tsp finely grated lime rind",
            "1 tbsp lime juice"
        ],
        "coordinates": [
            23.713199031463557,
            46.129082932265455
        ],
        "thumbnailUrl": "https://img.taste.com.au/rAPFD8d7/w720-h480-cfill-q80/taste/2011/06/coconut-crumbed-prawns-with-lime-aioli-120444-1.jpg"
    },
    {
        "title": "Piroshki (Russian hand pies)",
        "steps": [
            "To make the dough, combine the flour, salt and yeast in a large bowl. Make a well in the centre. Pour in the water and vegetable oil. Stir until just combined. Turn the dough onto a lightly floured surface. Knead for 5 minutes or until smooth and elastic. Place in a large, lightly oiled bowl. Cover with a clean tea towel. Set aside in a warm, draught-free place for 1 hour or until dough doubles in size. Punch down the dough. Knead on a lightly floured surface for 2 minutes or until smooth. Return the dough to the bowl. Cover and set aside in a warm, draught-free place for 30 minutes to prove.",
            "Meanwhile, heat the olive oil and butter in a large frying pan over medium-high heat. Add the onion and garlic. Cook, stirring, for 3-4 minutes or until onion softens. Add the beef and cook, breaking up any lumps with a wooden spoon, for 2-3 minutes or until beef is browned. Add cabbage and carrot. Cook, stirring, for 2-3 minutes or until cabbage wilts. Add dill, paprika and vinegar. Cook for 2 minutes. Season well. Transfer to a large bowl and set aside to cool completely.",
            "Turn dough onto a lightly floured surface. Knead for 1 minute or until smooth. Shape into a 30cm-long log. Cut log into 16 equal portions. Working with 4 portions at a time (cover remaining portions with a clean tea towel), roll each portion out to a 12cm disc. Spoon 2 tablespoonfuls of beef mixture onto 1 half of each disc. Fold over dough to enclose filling, pinching edge to seal. Repeat with remaining dough and beef mixture. 4 Add vegetable oil to a wok or large saucepan to come halfway up side of pan. Heat over medium-high heat. Deep-fry the piroshki, in batches, turning, for 2-3 minutes or until puffed and golden. Use a slotted spoon to transfer to a tray lined with paper towel to drain then serve."
        ],
        "ingredients": [
            "1 tbsp olive oil",
            "10g butter",
            "1 brown onion, finely chopped",
            "2 garlic cloves, crushed",
            "300g beef mince",
            "2 cups shredded savoy cabbage",
            "1 small carrot, peeled, coarsely grated",
            "2 tbsp finely chopped fresh dill leaves",
            "1 tsp masterfoods® paprika ground",
            "2 tsp coles italian red wine vinegar",
            "vegetable oil, to deep-fry",
            "450g (3 cups) plain flour",
            "1 tsp salt",
            "2 tsp (7g sachet) dried yeast",
            "310ml (1 1/4 cups) warm water",
            "1 1/2 tbsp vegetable oil"
        ],
        "coordinates": [
            92.45064175111878,
            65.09570950652437
        ],
        "thumbnailUrl": "https://img.taste.com.au/oxJBqHRh/w720-h480-cfill-q80/taste/2019/06/piroshki-russian-hand-pies-150270-2.jpg"
    },
    {
        "title": "Sugared cherry sponge cakes",
        "steps": [
            "Pat thawed cherries dry with paper towel. Place in a medium saucepan with the vanilla and caster sugar. Place over medium heat. Cook for 2 mins or until the sugar mixture dissolves. Reduce heat to low. Cook for 5 mins, stirring occasionally, or until the mixture thickens slightly. Add the lemon juice and kirsch, if using. Cook for a further 2 mins. Reserve 2 tbs of the cherry mixture in a small bowl. Place remaining cherry mixture in the fridge for 1 hour or until mixture thickens.",
            "Place the cream and reserved cherry mixture in a small saucepan over medium heat. Bring just to the boil. Remove from heat. Add chocolate. Set aside, without stirring, for 5 mins or until chocolate melts. Stir until well combined. Strain through a fine sieve into a bowl. Discard the solids. Set aside for 20 mins to cool completely.",
            "Place the sponge cakes on a clean work surface. Use a 6cm-diameter round pastry cutter to cut 12 discs from the cakes.",
            "Place 6 cake discs on a large serving platter. Spoon over the chilled cherry mixture. Top with the remaining 6 cake discs and press down gently. Spoon over the chocolate mixture, allowing it to drip down the sides. Set aside for 10 mins or until set.",
            "Place white sugar in a small bowl. Dip the cut side of fresh cherry in the sugar. Arrange on the cakes."
        ],
        "ingredients": [
            "1 1/2 cups frozen pitted cherries, thawed",
            "1 tsp vanilla bean paste",
            "3/4 cup (165g) caster sugar",
            "1 tbsp lemon juice",
            "1 tbsp kirsch (optional)",
            "1/3 cup (80ml) pouring (pure) cream",
            "120g white chocolate, chopped",
            "450g coles unfilled double sponge cake",
            "2 tbsp white sugar",
            "3 fresh cherries, halved, pitted"
        ],
        "coordinates": [
            35.950803437084126,
            20.314585595811582
        ],
        "thumbnailUrl": "https://img.taste.com.au/a8e_du0E/w720-h480-cfill-q80/taste/2019/11/sugared-cherry-sponge-cakes-taste-155698-2.jpg"
    },
    {
        "title": "Sugar-free banana bread",
        "steps": [
            "Preheat the oven to 160C or 140C fan-force. Grease and line an 11.5cm x 22cm (base measurements) loaf pan with baking paper.",
            "Mash bananas in a large bowl with a fork until smooth. Add eggs, oil, milk and vanilla and stir until combined. Sift wholemeal flour, plain flour, cinnamon, baking powder, bicarbonate and salt over banana mixture (tip in the flour kernels). Stir until combined. Spoon into prepared pan and level top with a spatula. Bake for 1 hour 10 minutes or until a skewer inserted in centre comes out clean. Stand in pan for 5 minutes. Transfer to a wire rack to cool."
        ],
        "ingredients": [
            "4 very ripe bananas",
            "2 eggs",
            "1/2 cup olive oil",
            "1/4 cup milk",
            "1 tsp vanilla bean paste",
            "1 tsp coles cinnamon ground",
            "1 cup wholemeal flour",
            "1 cup plain flour",
            "1 tsp baking powder",
            "1 tsp coles bicarbonate soda",
            "pinch salt"
        ],
        "coordinates": [
            28.33394000982507,
            7.698829480139409
        ],
        "thumbnailUrl": "https://img.taste.com.au/I6hRHLTY/w720-h480-cfill-q80/taste/2015/08/sugar-free-banana-bread-cropped-199839-1.jpg"
    },
    {
        "title": "Black bean brownies",
        "steps": [
            "Preheat oven to 180C or 160C fan-forced. Grease and line base and sides of a 16cm X 26cm baking tin with baking paper.",
            "Process beans until smooth, scraping down sides of bowl several times (this will take 1-2 minutes). Add dates, oil, milk and vanilla and process until smooth. Add cacao and process until combined. Spoon into prepared tin and level surface with a spatula.",
            "Arrange nuts on top in 16 clusters (imagine how you will cut brownie once cooked). Bake for 20 minutes or until top forms a crust. Cool in pan. Cut into 16 rectangles."
        ],
        "ingredients": [
            "425g can black beans, drained, rinsed",
            "12 fresh dates, pitted",
            "1/4 cup coconut oil",
            "1/4 cup milk",
            "1 tsp vanilla bean paste",
            "1/2 cup raw cacao",
            "1 tbsp walnuts, halved",
            "1 tbsp coles pistachios",
            "1 tbsp hazelnuts, halved"
        ],
        "coordinates": [
            -16.609400583526035,
            12.389350298194364
        ],
        "thumbnailUrl": "https://img.taste.com.au/WcoPNunl/w720-h480-cfill-q80/taste/2016/11/sugar-free-brownie-103057-1.jpeg"
    },
    {
        "title": "Cajun salmon with pineapple salad",
        "steps": [
            "Combine the oil, cumin, coriander, paprika and fennel in a bowl. Season with salt and pepper. Add the salmon and gently turn to evenly coat in the spice mixture.",
            "Heat a frying pan over medium-high heat. Cook the salmon for 3 mins each side for medium or until cooked to your liking. Transfer to a plate and set aside for 5 mins to rest.",
            "Meanwhile, combine the pineapple, cucumber, chilli, coriander and lime juice in a bowl. Divide among serving plates and serve with salmon."
        ],
        "ingredients": [
            "1 tbsp olive oil",
            "1 tsp coles brand ground cumin",
            "1 tsp ground coriander",
            "1 tsp sweet paprika",
            "1 tsp ground fennel",
            "4 x 150g salmon fillets",
            "1/2 ripe pineapple, peeled, cored, thinly sliced",
            "2 lebanese cucumbers, thinly sliced lengthways",
            "1 long red chilli, seeded, thinly sliced",
            "1/2 cup coriander leaves",
            "1 tbsp lime juice"
        ],
        "coordinates": [
            161.5279038397168,
            -9.784016334214895
        ],
        "thumbnailUrl": "https://img.taste.com.au/7TzC8ZGx/w720-h480-cfill-q80/taste/2016/11/cajun-salmon-with-pineapple-salad-98749-1.jpeg"
    },
    {
        "title": "BBQ steaks with creamy lemon sauce",
        "steps": [
            "Place the garlic, paprika, thyme, lemon rind and 1/4 cup (60ml) oil in a large bowl and stir to combine. Add steaks and toss to coat. Cover and place in the fridge for 30 mins or overnight to develop the flavours.",
            "To make the lemon buttermilk sauce, whisk the buttermilk, crème fraîche or sour cream, oil, mustard, vinegar, garlic, lemon rind and lemon juice in a bowl until well combined. Season. Add the chives and stir to combine. Place in the fridge to chill.",
            "Heat a barbecue grill or chargrill on medium-high. Season the steaks and cook for 3-4 mins each side for medium-rare or until cooked to your liking. Transfer the steaks to a plate and loosely cover with foil. Set aside for 5 mins to rest.",
            "Thickly slice the steaks and arrange on a serving platter. Drizzle with the buttermilk sauce to serve."
        ],
        "ingredients": [
            "2 garlic cloves, crushed",
            "2 tsp smoked paprika",
            "1 tbsp finely chopped thyme",
            "1 tsp finely grated lemon rind",
            "1/3 cup (80ml) olive oil",
            "6 (about 250g each) coles graze grass fed beef scotch fillet steaks",
            "1/4 cup (60ml) buttermilk",
            "1/4 cup (60ml) crème fraîche or sour cream",
            "2 tbsp extra virgin olive oil",
            "2 tsp coles dijon mustard",
            "1 tbsp sherry vinegar",
            "1 small garlic clove, crushed",
            "1 lemon, rind finely grated, juiced",
            "1/3 cup finely chopped chives"
        ],
        "coordinates": [
            -10.804161439739946,
            9.354302877888903
        ],
        "thumbnailUrl": "https://img.taste.com.au/XjkFPz5y/w720-h480-cfill-q80/taste/2020/09/october20_bbq-steaks-with-creamy-lemon-sauce-taste-165097-1.jpg"
    },
    {
        "title": "Oysters Kilpatrick",
        "steps": [
            "Preheat grill on medium-high heat. Place rock salt, in a thick layer, on a baking tray or heatproof plate. Arrange oysters (in their half-shells) on rock salt.",
            "Sprinkle Worcestershire sauce over oysters. Top with bacon. Grill, on the salt, for 5 to 8 minutes or until bacon is crisp. Sprinkle with parsley. Serve with lemon."
        ],
        "ingredients": [
            "2 cups rock salt",
            "24 oysters, shucked",
            "2 tbsp coles worcestershire sauce",
            "175g thin rashers rindless bacon, diced",
            "2 tbsp flat-leaf parsley leaves, chopped",
            "lemon wedges, to serve"
        ],
        "coordinates": [
            -55.23501528790275,
            5.584271242371033
        ],
        "thumbnailUrl": "https://img.taste.com.au/RvaRJFWl/w720-h480-cfill-q80/taste/2016/11/oysters-kilpatrick-1716-1.jpeg"
    },
    {
        "title": "Swedish meatball risoni tray bake",
        "steps": [
            "For the meatballs, place the breadcrumbs in a medium bowl. Pour over the milk. Set aside. Heat the butter in a large non-stick frying pan over medium heat. Add the onion and garlic and cook, stirring occasionally, for 3 minutes or until soft. Add to the breadcrumbs along with the mince, egg, parsley, salt and allspice. Mix until well combined.",
            "Line a baking tray with baking paper. Roll heaped tablespoonfuls of the mixture into balls. Place on the prepared tray. Cover. Place in the fridge for 1 hour to chill. Heat the oil in the frying pan over medium-high heat. Add the meatballs. Cook, turning, for 6-8 minutes or until cooked. Transfer to a plate.",
            "Wipe the frying pan clean. Heat the butter and oil in the frying pan over medium heat. Add the leek and garlic and cook, stirring often for 3 minutes or until soft. Add the zucchini and cook, stirring, for 2 minutes or until golden. Add the risoni and stir to coat. Add the stock and cream and stir to combine. Season well. Stir through half of the lemon rind.",
            "Preheat oven to 180C/160C fan forced. Transfer the risoni mixture to an 18 x 26cm baking dish. Top with the meatballs and cook for 30 minutes or until the risoni is tender and the liquid is absorbed. Set aside for 10 minutes to stand.",
            "Combine the remaining lemon rind and parsley leaves and sprinkle over the bake to serve. Serve with tomatoes and onion if desired."
        ],
        "ingredients": [
            "20g coles australian salted butter",
            "2 tsp coles extra virgin olive oil",
            "1 leek, trimmed, thinly sliced",
            "2 garlic cloves, finely chopped",
            "2 medium zucchini, trimmed, coarsely chopped",
            "260g (1 1/4 cups) dried risoni pasta",
            "625ml (2 1/2 cups) vegetable stock",
            "300ml ctn pouring cream",
            "finely grated rind of 1 lemon",
            "2 tbsp chopped fresh continental parsley",
            "halved cherry tomatoes, to serve (optional)",
            "finely chopped red onion, to serve (optional)",
            "50g (2/3 cup) fresh breadcrumbs, made from day-old bread",
            "80ml (1/3 cup) milk",
            "15g butter",
            "1 brown onion, finely chopped",
            "2 garlic cloves, finely chopped",
            "500g veal mince",
            "1 egg, lightly whisked",
            "2 tbsp finely chopped continental parsley",
            "1/2 tsp table salt",
            "1/4 tsp ground allspice",
            "1 tbsp extra virgin olive oil"
        ],
        "coordinates": [
            11.53125994948763,
            62.4488948403934
        ],
        "thumbnailUrl": "https://img.taste.com.au/npYp45O3/w720-h480-cfill-q80/taste/2019/07/swedish-meatball-risoni-tray-bake-152381-2.jpg"
    },
    {
        "title": "Golden syrup dumplings",
        "steps": [
            "Combine 2 cups (500ml) water, brown sugar, golden syrup and half the butter in a large saucepan. Stir over a low heat until melted.",
            "Meanwhile, use your fingertips to rub in the remaining 50g of the butter into flour Combine milk and 1 tablespoon golden syrup. Stir into the mixture until well combined.",
            "Bring the sauce to the boil then drop heaped dessert spoonfuls of the mixture into the sauce. Reduce the heat to low and simmer, covered for 15-20 minutes or until a skewer comes out clean. Serve with ice cream. Watch our step-by-step video below to see how to make this Golden syrup dumpling recipe."
        ],
        "ingredients": [
            "3/4 cup (155g) brown sugar",
            "1/3 cup (80ml) golden syrup, plus 1 tbsp extra",
            "100g butter",
            "1 1/2 cups (225g) coles white self-raising flour",
            "3/4 cup (185ml) milk"
        ],
        "coordinates": [
            38.237008951887496,
            35.33924247141342
        ],
        "thumbnailUrl": "https://img.taste.com.au/AvtJ3_LR/w720-h480-cfill-q80/taste/2016/11/golden-syrup-dumplings-31826-1.jpeg"
    },
    {
        "title": "Char-grilled polenta and tomatoes",
        "steps": [
            "Line a 21cm x 32cm (base measurement) tin with foil. Place stock in a large saucepan and bring to the boil. Add polenta and reduce heat to low. Stir constantly for 5 mins, or until thick and the polenta is tender. Stir in parmesan until melted, then spoon into the tin and smooth the surface. Refrigerate for 1 hr, or until firm.",
            "Preheat a barbecue grill or flat plate over medium-high heat. Turn out polenta and cut into 8 pieces, then cut each piece into 3 fingers. Brush both sides lightly with olive oil and cook for about 5 mins each side, or until golden brown and crisp. Set aside.",
            "Cook tomatoes on the grill for about 5 mins, or until softened and lightly charred. Serve on a platter with polenta, scattered with crumbled fetta and mint leaves, and drizzled with olive oil."
        ],
        "ingredients": [
            "6 1/2 cups coles real chicken stock or vegetable stock",
            "2 1/2 cups polenta",
            "1/2 cup coles shredded parmesan (or vegetarian hard cheese)",
            "1/2 cup coles pure olive oil",
            "3 x 250g cherry truss tomatoes",
            "100g coles australian-style fetta",
            "1/3 cup fresh mint leaves",
            "coles extra virgin olive oil, to drizzle"
        ],
        "coordinates": [
            22.434644899062597,
            13.612473778054047
        ],
        "thumbnailUrl": "https://img.taste.com.au/c7lCjoVc/w720-h480-cfill-q80/taste/2016/11/char-grilled-polenta-and-tomatoes-107650-1.jpeg"
    },
    {
        "title": "Spinach, pea and roast zucchini salad",
        "steps": [
            "Preheat oven to 180C or 160C fan-forced. Place zucchini and olive oil on a baking tray and toss to combine. Scatter garlic around zucchini on tray. Bake for 10-15 mins, or until zucchini is tender.",
            "Squeeze garlic from skin and place in a small bowl with extra virgin olive oil and vinegar. Season and whisk until well-combined.",
            "Place spinach, peas and zucchini in a large bowl. Add garlic dressing and toss to combine."
        ],
        "ingredients": [
            "4 zucchini, thinly sliced, lengthways",
            "1 tbsp coles pure olive oil",
            "6 cloves garlic, unpeeled",
            "1/4 cup coles extra virgin olive oil",
            "1 tbsp coles italian white wine vinegar",
            "200g baby spinach leaves",
            "1 1/2 cups coles frozen peas, blanched"
        ],
        "coordinates": [
            -0.01345082951333882,
            8.868195689116625
        ],
        "thumbnailUrl": "https://img.taste.com.au/mTcGA1Yc/w720-h480-cfill-q80/taste/2016/11/spinach-pea-and-roast-zucchini-salad-107326-1.jpeg"
    },
    {
        "title": "Ripper Thai beef noodle salad",
        "steps": [
            "Prepare the noodles following packet directions. Combine the lime juice, fish sauce, palm sugar, lemongrass, makrut lime and chilli in a small bowl.",
            "Heat a barbecue grill or chargrill on medium-high. Brush the beef with a little of the lime juice mixture. Cook on grill for 3 minutes each side for medium or until cooked to your liking. Transfer to a plate. Set aside to rest.",
            "Combine the noodles, cucumber, tomato, mint, coriander, bean sprouts and spring onion in a bowl. Thinly slice the beef across the grain. Add the beef to the noodle mixture. Pour over the remaining lime juice mixture. Toss to combine."
        ],
        "ingredients": [
            "100g pkt dried rice vermicelli noodles",
            "60ml (1/4 cup) lime juice",
            "25ml fish sauce",
            "5 tsp finely chopped palm sugar",
            "1 tbsp finely chopped fresh lemongrass",
            "3 makrut lime leaves, thinly sliced",
            "1 long fresh red chilli, finely chopped",
            "400g coles beef rump steak regular, fat removed",
            "2 lebanese cucumbers, peeled into ribbons",
            "200g punnet grape tomatoes, halved",
            "3/4 cup fresh mint leaves",
            "3/4 cup fresh coriander leaves",
            "55g (1 cup) trimmed bean sprouts",
            "3 spring onions (shallots), thinly sliced"
        ],
        "coordinates": [
            99.78749463901327,
            11.850421900685998
        ],
        "thumbnailUrl": "https://img.taste.com.au/EU9D0DbT/w720-h480-cfill-q80/taste/2016/11/ripper-thai-beef-noodle-salad-62642-1.jpeg"
    },
    {
        "title": "Banana bread",
        "steps": [
            "Preheat oven to 180°C. Grease and line the base and side of an 11 x 21cm x 6cm deep (base) loaf pan.",
            "Combine plain flour, self-raising flour, sugar and cinnamon in a large bowl. Whisk butter and eggs together. Stir in banana. Spoon into prepared pan. Smooth the surface.",
            "Bake for 45-50 mins or until a skewer inserted into the centre comes out clean. Set aside in the pan for 10 mins before turning out onto a wire rack. Serve warm spread with butter."
        ],
        "ingredients": [
            "1 cup (150g) plain flour",
            "1/2 cup (75g) self-raising flour",
            "1 cup brown sugar",
            "1 tsp coles cinnamon ground",
            "125g butter, melted, cooled",
            "2 eggs, whisked",
            "3 ripe bananas, mashed"
        ],
        "coordinates": [
            126.73169320264323,
            -8.335830939543865
        ],
        "thumbnailUrl": "https://img.taste.com.au/QtqlNOxg/w720-h480-cfill-q80/taste/2016/11/banana-bread-23369-1.jpeg"
    },
    {
        "title": "Trinidadian lamb curry",
        "steps": [
            "Combine 2 tablespoons lime juice, chillies, curry powder, cumin, garlic, coriander and 1 tablespoon oil in a ceramic bowl. Add lamb and stir until well combined. Cover and refrigerate for at least 2 hours.",
            "Heat remaining 2 tablespoons oil in a large saucepan over medium heat. Add onion and cook, stirring occasionally, for 3 minutes or until soft.",
            "Stir in lamb and marinade, tomatoes and stock. Bring to the boil. Reduce heat to low and simmer, uncovered, stirring occasionally, for 1 1/2 hours or until lamb is tender.",
            "Make sambal Combine bananas, lemon juice and coconut in a bowl. Set aside.",
            "Spoon curry along one edge of each roti and roll to enclose. Place, seam side down, on plates. Serve with sambal."
        ],
        "ingredients": [
            "1 large lime, juiced",
            "2 small red chillies, deseeded, chopped",
            "1 tbsp curry powder",
            "2 tsp ground cumin",
            "2 garlic cloves, crushed",
            "1/3 cup coriander leaves, finely chopped",
            "1/4 cup canola oil",
            "1kg diced lamb (leg or shoulder)",
            "1 large onion, finely chopped",
            "5 large tomatoes, deseeded, diced",
            "1 1/2 cups chicken stock",
            "8 roti bread (see note), warmed",
            "2 bananas, peeled, sliced",
            "2 tbsp lemon juice",
            "1/2 cup desiccated coconut"
        ],
        "coordinates": [
            -61.345893426778105,
            10.440185469792043
        ],
        "thumbnailUrl": "https://img.taste.com.au/wQwMGgk4/w720-h480-cfill-q80/taste/2016/11/trinidadian-lamb-curry-2271-1.jpeg"
    },
    {
        "title": "Tunisian mechwya",
        "steps": [
            "Preheat a barbecue or chargrill pan to medium heat. Cook garlic, turning occasionally, for 30 minutes or until charred and soft. Barbecue tomatoes and capsicums, cooking tomatoes for 10 minutes until soft and capsicums for 20 minutes or until charred all over.",
            "Cut garlic in half, squeeze cloves into a bowl and mash to a paste with lemon juice, spices and oil. Peel and seed the tomatoes and capsicums. Finely chop tomatoes, cut capsicums into strips, then stir into garlic mixture. Serve."
        ],
        "ingredients": [
            "1 bulb garlic",
            "4 roma tomatoes",
            "1 red capsicum",
            "1 green capsicum",
            "1 tbsp lemon juice",
            "1/4 tsp ground coriander",
            "1/4 tsp ground cumin",
            "1/4 tsp ground caraway",
            "1/4 tsp harissa (see note)",
            "60ml (1/4 cup) olive oil"
        ],
        "coordinates": [
            8.62782703216384,
            34.270906689624205
        ],
        "thumbnailUrl": "https://img.taste.com.au/ngvZj02x/w720-h480-cfill-q80/taste/2016/11/tunisian-mechwya-68698-1.jpeg"
    },
    {
        "title": "Beetroot hommus with Turkish toasts",
        "steps": [
            "Preheat oven to 180°C. Arrange Turkish bread in a single layer on a baking tray. Drizzle with 2 teaspoons of the oil. Bake, turning occasionally, for 5 mins or until light golden and crisp.",
            "Meanwhile, cook the cumin and coriander in a frying pan over medium heat for 1 min or until aromatic. Place in a food processor. Add the beetroot, chickpeas, lemon juice, tahini and half the remaining oil and process until smooth. Season.",
            "Place the hommus in a serving bowl and swirl in the yoghurt. Drizzle with remaining oil. Serve with the toasts."
        ],
        "ingredients": [
            "400g coles turkish pide, cut into 5mm-thick slices",
            "1/4 cup (60ml) olive oil",
            "1 tsp ground cumin",
            "1 tsp ground coriander",
            "450g can baby beetroot, drained",
            "400g can chickpeas, rinsed, drained",
            "2 tbsp lemon juice",
            "2 tbsp tahini",
            "1/2 cup (140g) greek-style yoghurt"
        ],
        "coordinates": [
            32.965788432919474,
            35.91434052265126
        ],
        "thumbnailUrl": "https://img.taste.com.au/S-e_BH4z/w720-h480-cfill-q80/taste/2018/06/july-18_beetroot-hummus-with-turkish-toasts-138681-1.jpg"
    },
    {
        "title": "Taiwanese chicken rice",
        "steps": [
            "Remove skin from the chicken, roughly chop and set aside. Combine the chicken and ginger in a large, deep frying pan and cover with cold water. Cover pan and bring just to a simmer over medium heat. Reduce heat to low and gently simmer for 30 minutes (see note). Transfer chicken to a board, reserving the broth.",
            "Meanwhile, heat the oil in a separate frying pan over medium-low heat. Add the chicken skin and cook for about 10 minutes, turning occasionally, until the fat has rendered and the skin is just becoming golden. Increase the heat slightly and cook a little longer, until the skin becomes crisp and golden brown. Use tongs to transfer the skin to a plate, if desired (for savouring later) or discard, reserving the fat in the pan.",
            "Reduce heat to medium-low in pan with reserved fat. Add the shallots to the pan and cook for 10-15 minutes, stirring occasionally, until deep golden brown in colour. Transfer to a plate lined with paper towel, reserving the fat in the pan.",
            "Add 1½ cups reserved broth to the frying pan with the reserved fat. Add soy sauce, rice wine and sugar. Bring to the boil over medium heat, then reduce heat to medium-low. Simmer for 5-10 minutes or until reduced by one third.",
            "When chicken meat is cool enough to handle, pull the meat from the bones and shred. Divide rice between serving bowls. Top with shredded chicken. Drizzle with the hot broth, top with crispy shallots and serve immediately."
        ],
        "ingredients": [
            "3 chicken marylands (see note)",
            "4 slices fresh ginger",
            "1 tbsp vegetable oil",
            "3 french or asian shallots, thinly sliced (see note)",
            "2 tbsp soy sauce",
            "2 tbsp chinese rice wine (shaoxing)",
            "1 tsp sugar",
            "steamed medium-grain rice, to serve"
        ],
        "coordinates": [
            121.34133826905682,
            23.89235975502836
        ],
        "thumbnailUrl": "https://img.taste.com.au/-obrXWpb/w720-h480-cfill-q80/taste/2023/09/taiwanese-chicken-rice-recipe-191154-1.jpg"
    },
    {
        "title": "Pampushky (Ukrainian garlic bread)",
        "steps": [
            "Place the milk and sugar in a jug. Add the yeast and use a skewer to stir until combined. Set aside in a warm, draught-free place for 5 minutes or until frothy.",
            "Whisk together the flour and salt in a large bowl. Make a well in the centre. Add the milk mixture and oil and stir with a wooden spoon until the dough comes together. Turn out onto a lightly floured surface. Knead for 10 minutes or until dough is smooth and elastic.",
            "Transfer dough to a large, lightly oiled bowl and cover with plastic wrap. Set aside in a warm, draught-free place place for 1 hour or until doubled in size.",
            "Meanwhile, grease a 22cm (base size) round springform pan. Line the base and side with baking paper.",
            "Use your fist to punch back the dough. Divide into 8 equal portions. Roll each portion into a ball. Place balls in the prepared pan, 1cm apart. Cover and set aside for 30 minutes.",
            "Meanwhile, preheat oven to 180C/160C fan forced.",
            "Brush dough balls with beaten egg. Bake for 30 minutes or until golden brown.",
            "Meanwhile, to make the topping, combine all topping ingredients in a small bowl. Season with salt.",
            "Brush topping over hot buns. Set aside for 15 minutes to cool slightly. Transfer to a serving plate or board and serve warm or room temperature."
        ],
        "ingredients": [
            "250ml (1 cup) milk, warmed (see notes)",
            "1 tbsp caster sugar",
            "2 tsp (7g sachet) dried yeast",
            "375g (2 1/2 cups) bread flour, plus extra, to dust",
            "2 tsp salt",
            "2 tbsp olive oil",
            "1 egg, lightly whisked",
            "2 tbsp olive oil",
            "3 garlic cloves, crushed",
            "1 tbsp chopped fresh continental parsley leaves",
            "1 tbsp chopped fresh dill"
        ],
        "coordinates": [
            33.56962835728346,
            48.847085500435696
        ],
        "thumbnailUrl": "https://img.taste.com.au/1BDKsBTB/w720-h480-cfill-q80/taste/2022/07/pampushky-ukrainian-garlic-bread-recipe-179607-1.jpg"
    },
    {
        "title": "Lamb al asador with chimichurri and kumara wedges",
        "steps": [
            "For the chimichurri, combine the herbs, bay leaves, garlic, chilli, oil and vinegar in a bowl. Season, then stand for at least 1 hour to allow the flavours to develop.",
            "Preheat the oven to 200°C.",
            "Place the kumara on a large baking tray in a single layer. Season well and drizzle with oil. Bake for 20-25 minutes until golden and crisp.",
            "Meanwhile, preheat a barbecue or chargrill pan to medium-high. Season the lamb and brush both sides with plenty of chimichurri. Cook the lamb, turning once, for 20-30 minutes until cooked but still pink in the centre. Rest, loosely covered with foil, for 15 minutes.",
            "Drizzle the spring onion with oil and sprinkle with salt. Chargrill for 3-4 minutes or until charred and just cooked.",
            "Slice lamb and serve with spring onion, kumara and remaining chimichurri."
        ],
        "ingredients": [
            "1.2kg (about 2 large) kumara, cut into thin wedges",
            "olive oil, to drizzle",
            "1.5-2kg boneless lamb leg, butterflied (ask your butcher to do this)",
            "2 bunches spring onions, trimmed",
            "1 cup flat-leaf parsley leaves, chopped",
            "1/4 cup rosemary leaves, chopped",
            "1/2 cup oregano leaves, chopped",
            "1/3 cup thyme leaves, chopped",
            "4 bay leaves",
            "6 garlic cloves, finely chopped",
            "1 tsp chilli powder",
            "1 cup (250ml) olive oil",
            "1/2 cup (125ml) sherry vinegar or red wine vinegar"
        ],
        "coordinates": [
            -56.78234786114144,
            -32.09933978045956
        ],
        "thumbnailUrl": "https://img.taste.com.au/X0wX6JUj/w720-h480-cfill-q80/taste/2016/11/lamb-al-asador-with-chimichurri-and-kumara-wedges-67066-1.jpeg"
    },
    {
        "title": "American-style bbq brisket sub",
        "steps": [
            "Preheat oven to 180°C. Place the meat from the beef packet in an ovenproof casserole dish. Cover with foil. Bake for 15 mins. Remove the foil and bake for a further 10 mins or until heated through. Set aside to cool.",
            "Meanwhile, heat a barbecue grill or chargrill on high. Cook the ciabatta, cut-side down, for 1-2 mins or until toasted. Spread with the mustard. Prepare the salad kit in a large bowl following packet directions.",
            "Use 2 forks to shred the beef. Add the sauce from the beef packet and stir to combine. Top the bread base with the slaw, beef mixture and cheese. Season. Top with the bread top. Cut the sub into 4 even pieces to serve."
        ],
        "ingredients": [
            "800g pkt coles made easy slow cooked beef brisket with american style bbq sauce",
            "1 coles bakery stone baked by laurent ciabatta*, split horizontally",
            "1 tbsp coles beer flavoured dijon mustard",
            "400g pkt coles american bbq slaw kit",
            "3 coles monterey jack cheese slices"
        ],
        "coordinates": [
            -103.99016555386068,
            42.56890302194093
        ],
        "thumbnailUrl": "https://img.taste.com.au/Pazb9LWj/w720-h480-cfill-q80/taste/2020/06/july20_american-style-bbq-brisket-sub-162744-1.jpg"
    },
    {
        "title": "Uzbekistan plov",
        "steps": [
            "Heat 1 tbsp oil in a flameproof casserole dish over medium-high heat. Cook half the lamb, turning occasionally, for 5 minutes or until golden. Transfer to a plate. Repeat with the remaining lamb.",
            "Reduce heat to medium. Heat the remaining oil in the dish. Add the onion and carrot. Cook, stirring occasionally, for 5 minutes or until soft and lightly golden.",
            "Meanwhile, cut the top off the garlic bulb to expose the cloves. Remove any excess loose papery skin, but keep the head intact.",
            "Return the lamb to the dish. Add the cumin, coriander, paprika and chilli. Stir until combined. Pour in the stock and 250ml (1 cup) water. Bring just to the boil then reduce heat to low. Nestle the garlic bulb in the mixture. Add the bay leaf. Cover and simmer gently for 1 hour 30 minutes or until the lamb is tender.",
            "Uncover and scatter over the rice and sultanas in an even layer. Cover and cook, stirring once during cooking, for a further 20 minutes or until the rice is tender and liquid has been absorbed. Remove from heat and set aside, covered, for 10 minutes. Sprinkle with the parsley and squeeze the soft garlic bulb over the plov to serve."
        ],
        "ingredients": [
            "2 tbsp vegetable oil",
            "750g diced lamb shoulder",
            "1 large onion, halved, thinly sliced",
            "2 large carrots, peeled, halved lengthways, thinly sliced",
            "1 garlic bulb",
            "1½ tsp ground cumin",
            "1 tsp ground coriander",
            "1 tsp ground paprika",
            "500ml (2 cups) chicken stock",
            "1 dried bay leaf",
            "250g (1¼ cups) basmati rice, well rinsed (see note)",
            "45g (¼ cup) sultanas",
            "2 tbsp chopped fresh continental parsley leaves"
        ],
        "coordinates": [
            62.486208167488506,
            40.210462507519104
        ],
        "thumbnailUrl": "https://img.taste.com.au/rZjYd0P-/w720-h480-cfill-q80/taste/2023/07/uzbekistan-plov-189386-1.jpg"
    },
    {
        "title": "Warming Vietnamese pho recipe",
        "steps": [
            "Place stock, ginger, star anise, fish sauce, soy sauce and 2 cups cold water in a large saucepan over high heat. Cover. Bring to the boil. Reduce heat to low. Simmer for 5 minutes.",
            "Meanwhile, place noodles in a heatproof bowl. Cover with boiling water. Stand for 3 to 5 minutes or until tender. Separate with a fork. Drain.",
            "Using a slotted spoon, remove ginger and star anise from stock mixture. Add tofu. Stir in lime juice. Divide noodles and stock mixture between bowls. Top with coriander, beansprouts, chilli and onion. Serve with lime wedges."
        ],
        "ingredients": [
            "1 litre chicken stock",
            "3cm piece fresh ginger, peeled",
            "2 star anise",
            "1 tbsp fish sauce",
            "2 tsp soy sauce",
            "100g rice-stick (pad thai) noodles",
            "2 tbsp lime juice",
            "300g coles nature's kitchen firm tofu, cut into 3cm cubes",
            "1 cup fresh coriander leaves",
            "1 cup beansprouts, trimmed",
            "2 small red chillies, thinly sliced",
            "3 green onions, thinly sliced",
            "lime wedges, to serve"
        ],
        "coordinates": [
            106.1864919321242,
            8.878336102223473
        ],
        "thumbnailUrl": "https://img.taste.com.au/ZcjPFjOE/w720-h480-cfill-q80/taste/2010/01/vietnamese-pho-cropped-image-198306-1.jpg"
    },
    {
        "title": "Our favourite pea and ham soup recipe",
        "steps": [
            "Rinse split peas under cold running water until water runs clear. Drain.",
            "Heat oil in a saucepan over medium heat. Add carrot, celery, onion and garlic, and cook, stirring, for 5 minutes or until the onion softens.",
            "Add split peas, ham hocks and water. Bring to the boil over high heat. Reduce heat to medium-low and simmer, covered, for 2 - 2 1/2 hours or until ham hocks are tender and the meat is falling away from the bones. Set aside for 5 minutes to cool slightly. Remove ham hocks from pan. Remove the meat from bones. Coarsely chop meat and set aside.",
            "Place one-quarter of the pea mixture in the bowl of a food processor and process until smooth. Return to pan with ham. Repeat with remaining pea mixture. Taste and season. Stir over medium-high heat for 5 minutes or until hot.",
            "Ladle soup into bowls and serve immediately with bread."
        ],
        "ingredients": [
            "290g (1 1/3 cups) green split peas",
            "2 tbsp olive oil",
            "2 carrots, peeled, chopped",
            "2 sticks celery, trimmed, chopped",
            "1 brown onion, halved, chopped",
            "3 garlic cloves, crushed",
            "700g ham or bacon hocks",
            "1.5l (6 cups) cold water",
            "crusty bread, to serve"
        ],
        "coordinates": [
            51.29518622219397,
            14.76223880414757
        ],
        "thumbnailUrl": "https://img.taste.com.au/PbVM2hqS/w720-h480-cfill-q80/taste/2010/01/pea-and-ham-soup-cropped-199842-1.jpg"
    }
]